jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/


/** \addtogroup TLE9563_FUNCLAYER_api
 *  @{
 */

/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "TLE9563_FuncLayer.h"

/*******************************************************************************
**                           Local Macro Definitions                          **
*******************************************************************************/


/*******************************************************************************
**                           Local Type Definitions                           **
*******************************************************************************/
/** \brief function pointer fpDEVICE_initDeviceReg
*/
typedef uint8_t (*fpDEVICE_initDeviceReg)(uint16_t);

/******************************************************************************/
/**                        Local Variable Definitions                        **/
/******************************************************************************/
static uint8_t u8_cyclicStatUpdateCount = 0;
static fpDEVICE_getDeviceReg fp_cyclicStatGetFuncs[] =  {  &TLE9563_getSUPSTAT,
                                                           &TLE9563_getTHERMSTAT,
                                                           &TLE9563_getDEVSTAT,
                                                           &TLE9563_getBUSSTAT,
                                                           &TLE9563_getWKSTAT,
                                                           &TLE9563_getWKLVLSTAT,
                                                           &TLE9563_getHSOLOCOTSTAT,
                                                           &TLE9563_getGENSTAT,
                                                           &TLE9563_getTDREG,
                                                           &TLE9563_getDSOV,
                                                           &TLE9563_getEFFTDONOFF1,
                                                           &TLE9563_getEFFTDONOFF2,
                                                           &TLE9563_getEFFTDONOFF3,
                                                           &TLE9563_getTRISEFALL1,
                                                           &TLE9563_getTRISEFALL2,
                                                           &TLE9563_getTRISEFALL3,
                                                           &TLE9563_getSWKSTAT,
                                                           &TLE9563_getSWKECNTSTAT,
                                                           &TLE9563_getSWKCDRSTAT,
                                                           &TLE9563_getFAMPRODSTAT,
                                                           &TLE9563_getSWKOSCCALSTAT,
                                                        };

static fpDEVICE_updateRamReg fp_cyclicStatUpdateFuncs[] = {  &TLE9563_updateRamSUPSTAT,
                                                             &TLE9563_updateRamTHERMSTAT,
                                                             &TLE9563_updateRamDEVSTAT,
                                                             &TLE9563_updateRamBUSSTAT,
                                                             &TLE9563_updateRamWKSTAT,
                                                             &TLE9563_updateRamWKLVLSTAT,
                                                             &TLE9563_updateRamHSOLOCOTSTAT,
                                                             &TLE9563_updateRamGENSTAT,
                                                             &TLE9563_updateRamTDREG,
                                                             &TLE9563_updateRamDSOV,
                                                             &TLE9563_updateRamEFFTDONOFF1,
                                                             &TLE9563_updateRamEFFTDONOFF2,
                                                             &TLE9563_updateRamEFFTDONOFF3,
                                                             &TLE9563_updateRamTRISEFALL1,
                                                             &TLE9563_updateRamTRISEFALL2,
                                                             &TLE9563_updateRamTRISEFALL3,
                                                             &TLE9563_updateRamSWKSTAT,
                                                             &TLE9563_updateRamSWKECNTSTAT,
                                                             &TLE9563_updateRamSWKCDRSTAT,
                                                             &TLE9563_updateRamFAMPRODSTAT,
                                                             &TLE9563_updateRamSWKOSCCALSTAT,
                                                          };

/******************************************************************************/
/**                        Local Function Definitions                        **/
/******************************************************************************/


