jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/*******************************************************************************
**                        Global Variable Definitions                         **
*******************************************************************************/
extern sDEVICE_deviceDriver s_deviceDriver = { TLE9563_DEVICEDRIVER_STATUS_INIT,
                                               TLE9563_DEVICEDRIVER_ERRORLOG_INIT,
                                               0x0000,
                                               0x0000,
                                               NULL,
                                               NULL,
                                               NULL,
                                               0x0000,
                                             };

/*******************************************************************************
**                         Global Function Definitions                        **
*******************************************************************************/
/** \brief Device Driver Cyclic Task
 *  \brief This function needs to be called continuously by the application
 * 
 *  \return uint8_t Device Driver ErrorLog (0: INIT, 1: STARTED, 2: BUSY, 3: SPI_RECEIVE_ERR)
 */
uint8_t TLE9563_deviceDriverCyclicTask(void)
{ 
  uint32_t u32_pdmaInterruptStatusMasked;
  uint32_t u32_spiRxFifoStatus;
  uint16_t u16_tempRegData;
  
  switch(s_deviceDriver.u8_deviceDriverStatus)
  {
  case TLE9563_DEVICEDRIVER_STATUS_INIT:
    /* dynamic set register requests to write to control registers have highest priority */
    if(s_deviceDriver.fp_setReg)
    {
      s_deviceDriver.u8_deviceDriverStatus = TLE9563_DEVICEDRIVER_STATUS_CYCLIC_UPDATE;
      s_deviceDriver.fp_setReg(s_deviceDriver.u16_setBitValue);
      s_deviceDriver.fp_setReg = NULL;
      s_deviceDriver.u8_deviceDriverErrorLog = TLE9563_DEVICEDRIVER_ERRORLOG_STARTED;
      break;
    }
    /* cyclic get register requests to update status registers have lowest priority */
    else if(s_deviceDriver.fp_getReg)
    {
      s_deviceDriver.u8_deviceDriverStatus = TLE9563_DEVICEDRIVER_STATUS_CYCLIC_UPDATE;
      s_deviceDriver.fp_getReg = fp_cyclicStatGetFuncs[u8_cyclicStatUpdateCount];
      s_deviceDriver.fp_updateRamReg = fp_cyclicStatUpdateFuncs[u8_cyclicStatUpdateCount];
      s_deviceDriver.fp_getReg();
      if(u8_cyclicStatUpdateCount < TLE9563_DEVICEDRIVER_CYCLICSTATUPDATENUM)
      {
        u8_cyclicStatUpdateCount ++;
      }
      else
      {
        u8_cyclicStatUpdateCount = 0;
      }
      s_deviceDriver.u8_deviceDriverErrorLog = TLE9563_DEVICEDRIVER_ERRORLOG_STARTED;
      break;
    }
    else
    {
      s_deviceDriver.u8_deviceDriverErrorLog = TLE9563_DEVICEDRIVER_ERRORLOG_INIT;
      s_deviceDriver.u8_deviceDriverStatus = TLE9563_DEVICEDRIVER_STATUS_INIT;
      break;
    }
    break;
    
  case TLE9563_DEVICEDRIVER_STATUS_CYCLIC_UPDATE:
    /* check, if PDMA and SPI are done */
    u32_pdmaInterruptStatusMasked = Cy_PDMA_Chnl_GetInterruptStatusMasked(PDMA_INSTANCE, PDMA_CH11);
    u32_spiRxFifoStatus = Cy_SCB_SPI_GetRxFifoStatus(CY_SPI_SCB_TYPE);
    if (((u32_pdmaInterruptStatusMasked & CY_PDMA_INTRCAUSE_COMPLETION) != 0u) && ((u32_spiRxFifoStatus & CY_SCB_SPI_RX_TRIGGER) != 0u))
    {
      /* clear device driver error log */
      s_deviceDriver.u8_deviceDriverErrorLog = TLE9563_DEVICEDRIVER_ERRORLOG_INIT;
      /* check CRC of received SPI message*/
    #if (TLE9563_CRC_EN == 1)
      if(s_deviceDriver.un_SpiRx.au8Bytes[3] == s_deviceDriver.un_CrcResult.au8Bytes[0])
    #elif (TLE9563_CRC_EN == 0)
      if(s_deviceDriver.un_SpiRx.au8Bytes[3] == TLE9563_CRC_STATIC_PATTERN_MISO)
    #endif
      {
        /* update SIF */
        TLE9563->SIF.byte = (uint8_t)(s_deviceDriver.un_SpiRx.u32Word & 0x000000FF);
        /* update status register, if provided */
        if(s_deviceDriver.fp_updateRamReg)
        {
          u16_tempRegData = (uint16_t)((s_deviceDriver.un_SpiRx.u32Word & 0x00FFFF00) >> 8);
          s_deviceDriver.fp_updateRamReg(u16_tempRegData);
          s_deviceDriver.fp_updateRamReg = NULL;
        }
      }
      else
      {
        s_deviceDriver.u8_deviceDriverErrorLog = TLE9563_DEVICEDRIVER_ERRORLOG_SPI_RECEIVE_ERR;
      }
    
      /* Complete SPI */
      Cy_SCB_SPI_ClearRxFifoStatus(CY_SPI_SCB_TYPE, CY_SCB_SPI_RX_TRIGGER);
      /* Complete PDMA */
      Cy_PDMA_Chnl_ClearInterrupt(PDMA_INSTANCE, PDMA_CH11);

      /* Start next SPI command */
      /* dynamic set register requests to write to control registers have highest priority */
      if(s_deviceDriver.fp_setReg)
      {
        s_deviceDriver.u8_deviceDriverStatus = TLE9563_DEVICEDRIVER_STATUS_CYCLIC_UPDATE;
        s_deviceDriver.fp_setReg(s_deviceDriver.u16_setBitValue);
        s_deviceDriver.fp_setReg = NULL;
        s_deviceDriver.u8_deviceDriverErrorLog = s_deviceDriver.u8_deviceDriverErrorLog | TLE9563_DEVICEDRIVER_ERRORLOG_STARTED;
        break;
      }
      /* cyclic get register requests to update status registers have lowest priority */
      else if(s_deviceDriver.fp_getReg)
      {
        s_deviceDriver.u8_deviceDriverStatus = TLE9563_DEVICEDRIVER_STATUS_CYCLIC_UPDATE;
        s_deviceDriver.fp_getReg = fp_cyclicStatGetFuncs[u8_cyclicStatUpdateCount];
        s_deviceDriver.fp_updateRamReg = fp_cyclicStatUpdateFuncs[u8_cyclicStatUpdateCount];
        s_deviceDriver.fp_getReg();
        if(u8_cyclicStatUpdateCount < TLE9563_DEVICEDRIVER_CYCLICSTATUPDATENUM)
        {
          u8_cyclicStatUpdateCount ++;
        }
        else
        {
          u8_cyclicStatUpdateCount = 0;
        }
        s_deviceDriver.u8_deviceDriverErrorLog = s_deviceDriver.u8_deviceDriverErrorLog | TLE9563_DEVICEDRIVER_ERRORLOG_STARTED;
        break;
      }
      else
      {
        s_deviceDriver.u8_deviceDriverStatus = TLE9563_DEVICEDRIVER_STATUS_INIT;
        break;
      }
    }
    else
    {
     s_deviceDriver.u8_deviceDriverErrorLog = TLE9563_DEVICEDRIVER_ERRORLOG_BUSY;
    }
    break;
    
  default:
    /* invalid device driver status */
    break;
  }
  
  return s_deviceDriver.u8_deviceDriverErrorLog;
}

