jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Initialize the Device Modules based on users configuration
 *  \note This function is blocking while Spi write commands are sent out to all device registers
 *  \note In case the BDRV needs to remain disabled after initialization, put HBx mode = 0x11 (ACTIVE_OFF) as users configuration. 
 *  \note Use \ref TLE9563_setAllHbx() at desired time to enable the BDRV.
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_Init(void)
{
  uint8_t u8_success = 0;
  fpDEVICE_initDeviceReg fp_initRegTemp;
  uint16_t u16_initRegValueTemp;
  uint8_t u8_initRegisterCounter;
  uint8_t u8_initRegisterNum;
  uint8_t u8_initStatUpdateCount = 0;
  
  fpDEVICE_initDeviceReg fp_initRegAll[] = {  &TLE9563_setModeSupplyCtrlReg,
                                              &TLE9563_setHwCtrlReg,
                                              &TLE9563_setBusCtrlReg,
                                              &TLE9563_setWk4CtrlReg,
                                              &TLE9563_setWk5CtrlReg,
                                              &TLE9563_setTimerCtrlReg,
                                              &TLE9563_setHsSwitchShutdownCtrlReg,
                                              &TLE9563_setIntrMaskCtrlReg,
                                              &TLE9563_setPwm1CtrlReg,
                                              &TLE9563_setPwm2CtrlReg,
                                              &TLE9563_setPwm3CtrlReg,
                                              &TLE9563_setPwm4CtrlReg,
                                              &TLE9563_setHsCtrlReg,
                                              &TLE9563_setGenBridgeCtrlReg,
                                              &TLE9563_setCsaCtrlReg,
                                              &TLE9563_setVdsLsCtrlReg,
                                              &TLE9563_setVdsHsCtrlReg,
                                              &TLE9563_setCcpBlankHb1ActCtrlReg,
                                              &TLE9563_setCcpBlankHb2ActCtrlReg,
                                              &TLE9563_setCcpBlankHb3ActCtrlReg,
                                              &TLE9563_setCcpBlankHb1FwCtrlReg,
                                              &TLE9563_setCcpBlankHb2FwCtrlReg,
                                              &TLE9563_setCcpBlankHb3FwCtrlReg,
                                              &TLE9563_setHbModeCtrlReg,
                                              &TLE9563_setTpreChgCtrlReg,
                                              &TLE9563_setTpreDischgCtrlReg,
                                              &TLE9563_setStIchgCtrlReg,
                                              &TLE9563_setIchgHb1ActCtrlReg,
                                              &TLE9563_setIchgHb2ActCtrlReg,
                                              &TLE9563_setIchgHb3ActCtrlReg,
                                              &TLE9563_setIchgHb1FwCtrlReg,
                                              &TLE9563_setIchgHb2FwCtrlReg,
                                              &TLE9563_setIchgHb3FwCtrlReg,
                                              &TLE9563_setIchgMaxCtrlReg,
                                              &TLE9563_setPreChgInitHb1CtrlReg,
                                              &TLE9563_setPreChgInitHb2CtrlReg,
                                              &TLE9563_setPreChgInitHb3CtrlReg,
                                              &TLE9563_setTdonHb1CtrlReg,
                                              &TLE9563_setTdonHb2CtrlReg,
                                              &TLE9563_setTdonHb3CtrlReg,
                                              &TLE9563_setTdoffHb1CtrlReg,
                                              &TLE9563_setTdoffHb2CtrlReg,
                                              &TLE9563_setTdoffHb3CtrlReg,
                                              &TLE9563_setBrakeCtrlReg,
                                              &TLE9563_setCanSwkCtrlReg,
                                              &TLE9563_setSwkBtl1CtrlReg,
                                              &TLE9563_setSwkId1CtrlReg,
                                              &TLE9563_setSwkId0CtrlReg,
                                              &TLE9563_setSwkMaskId1CtrlReg,
                                              &TLE9563_setSwkMaskId0CtrlReg,
                                              &TLE9563_setSwkData3CtrlReg,
                                              &TLE9563_setSwkData2CtrlReg,
                                              &TLE9563_setSwkData1CtrlReg,
                                              &TLE9563_setSwkData0CtrlReg,
                                              &TLE9563_setSwkCanFdCtrlReg,
                                              &TLE9563_setSwkOscTrimCtrlReg,
                                              &TLE9563_setSwkCdrCtrlReg,
                                              &TLE9563_setSwkCdrLimitCtrlReg,
                                              &TLE9563_setSwkDataLengthCodeReg,
                                              NULL,
                                           };

  uint16_t u16_initRegValueAll[] = { (uint16_t)TLE9563_M_S_CTRL,
                                     (uint16_t)TLE9563_HW_CTRL,
                                     (uint16_t)TLE9563_BUS_CTRL,
                                     (uint16_t)TLE9563_WK_CTRL_BNK3,
                                     (uint16_t)TLE9563_WK_CTRL_BNK4,
                                     (uint16_t)TLE9563_TIMER_CTRL,
                                     (uint16_t)TLE9563_SW_SD_CTRL,
                                     (uint16_t)TLE9563_INT_MASK,
                                     (uint16_t)TLE9563_PWM_CTRL_BNK0,
                                     (uint16_t)TLE9563_PWM_CTRL_BNK1,
                                     (uint16_t)TLE9563_PWM_CTRL_BNK2,
                                     (uint16_t)TLE9563_PWM_CTRL_BNK3,
                                     (uint16_t)TLE9563_HS_CTRL,
                                     (uint16_t)TLE9563_GENCTRL,
                                     (uint16_t)TLE9563_CSA,
                                     (uint16_t)TLE9563_LS_VDS,
                                     (uint16_t)TLE9563_HS_VDS,
                                     (uint16_t)TLE9563_CCP_BLK_BNK0,
                                     (uint16_t)TLE9563_CCP_BLK_BNK1,
                                     (uint16_t)TLE9563_CCP_BLK_BNK2,
                                     (uint16_t)TLE9563_CCP_BLK_BNK4,
                                     (uint16_t)TLE9563_CCP_BLK_BNK5,
                                     (uint16_t)TLE9563_CCP_BLK_BNK6,
                                     (uint16_t)TLE9563_HBMODE,
                                     (uint16_t)TLE9563_TPRECHG_BNK0,
                                     (uint16_t)TLE9563_TPRECHG_BNK1,
                                     (uint16_t)TLE9563_ST_ICHG,
                                     (uint16_t)TLE9563_HB_ICHG_BNK0,
                                     (uint16_t)TLE9563_HB_ICHG_BNK1,
                                     (uint16_t)TLE9563_HB_ICHG_BNK2,
                                     (uint16_t)TLE9563_HB_ICHG_BNK4,
                                     (uint16_t)TLE9563_HB_ICHG_BNK5,
                                     (uint16_t)TLE9563_HB_ICHG_BNK6,
                                     (uint16_t)TLE9563_HB_ICHG_MAX,
                                     (uint16_t)TLE9563_HB_PCHG_INIT_BNK0,
                                     (uint16_t)TLE9563_HB_PCHG_INIT_BNK1,
                                     (uint16_t)TLE9563_HB_PCHG_INIT_BNK2,
                                     (uint16_t)TLE9563_TDON_HB_CTRL_BNK0,
                                     (uint16_t)TLE9563_TDON_HB_CTRL_BNK1,
                                     (uint16_t)TLE9563_TDON_HB_CTRL_BNK2,
                                     (uint16_t)TLE9563_TDOFF_HB_CTRL_BNK0,
                                     (uint16_t)TLE9563_TDOFF_HB_CTRL_BNK1,
                                     (uint16_t)TLE9563_TDOFF_HB_CTRL_BNK2,
                                     (uint16_t)TLE9563_BRAKE,
                                     (uint16_t)TLE9563_SWK_CTRL,
                                     (uint16_t)TLE9563_SWK_BTL1_CTRL,
                                     (uint16_t)TLE9563_SWK_ID0_CTRL, 
                                     (uint16_t)TLE9563_SWK_ID1_CTRL,
                                     (uint16_t)TLE9563_SWK_MASK_ID1_CTRL,
                                     (uint16_t)TLE9563_SWK_MASK_ID0_CTRL,
                                     (uint16_t)TLE9563_SWK_DATA3_CTRL,
                                     (uint16_t)TLE9563_SWK_DATA2_CTRL, 
                                     (uint16_t)TLE9563_SWK_DATA1_CTRL, 
                                     (uint16_t)TLE9563_SWK_DATA0_CTRL,
                                     (uint16_t)TLE9563_SWK_CAN_FD_CTRL, 
                                     (uint16_t)TLE9563_SWK_OSC_TRIM_CTRL,
                                     (uint16_t)TLE9563_SWK_CDR_CTRL, 
                                     (uint16_t)TLE9563_SWK_CDR_LIMIT, 
                                     (uint16_t)TLE9563_SWK_DLC_CTRL,
                                     (uint16_t)0x0000,
                                  };

  TLE9563_initSpi();
  TLE9563_initDma();
  
