jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
  /* Clear POR */
  TLE9563_clrSupSts();
  TLE9563_deviceDriverCyclicTask();
  while(TLE9563_deviceDriverCyclicTask() == TLE9563_DEVICEDRIVER_ERRORLOG_BUSY);
  
#if (TLE9563_CRC_REC_INIT == 1)
  /* set CRC according to users settings */
  TLE9563_recoverCrc();
  TLE9563_deviceDriverCyclicTask();
  while(TLE9563_deviceDriverCyclicTask() == TLE9563_DEVICEDRIVER_ERRORLOG_BUSY);
  /* clear DEV_STAT in case there was a CRC mismatch before */
  TLE9563_clrDevSts();
  TLE9563_deviceDriverCyclicTask();
  while(TLE9563_deviceDriverCyclicTask() == TLE9563_DEVICEDRIVER_ERRORLOG_BUSY);
  /* Clear POR in case there was a CRC mismatch before and first POR clear cmd was ignored */
  TLE9563_clrSupSts();
  TLE9563_deviceDriverCyclicTask();
  while(TLE9563_deviceDriverCyclicTask() == TLE9563_DEVICEDRIVER_ERRORLOG_BUSY);
#endif
  
  /* Initialize all control registers */
  u8_initRegisterNum = (uint8_t)(sizeof(u16_initRegValueAll)/sizeof(u16_initRegValueAll[0])) - 1;
  for(u8_initRegisterCounter = 0; u8_initRegisterCounter < u8_initRegisterNum; u8_initRegisterCounter++)
  {
    fp_initRegTemp = fp_initRegAll[u8_initRegisterCounter];
    u16_initRegValueTemp = u16_initRegValueAll[u8_initRegisterCounter];
    fp_initRegTemp(u16_initRegValueTemp);
    TLE9563_deviceDriverCyclicTask();
    while(TLE9563_deviceDriverCyclicTask() == TLE9563_DEVICEDRIVER_ERRORLOG_BUSY);
    if((s_deviceDriver.u8_deviceDriverErrorLog == TLE9563_DEVICEDRIVER_ERRORLOG_SPI_RECEIVE_ERR) || (TLE9563->SIF.bit.SPI_CRC_FAIL == 1))
    {
      u8_success = 0;
      return u8_success;
    }
  }
  /* Initialize first get-register functionpointer */
  s_deviceDriver.fp_getReg = &TLE9563_getSUPSTAT;
  s_deviceDriver.fp_updateRamReg = &TLE9563_updateRamSUPSTAT;
  /* Read out all status registers */
  for(u8_initStatUpdateCount = 0; u8_initStatUpdateCount < TLE9563_DEVICEDRIVER_CYCLICSTATUPDATENUM; u8_initStatUpdateCount++)
  {
    TLE9563_deviceDriverCyclicTask();
    while(TLE9563_deviceDriverCyclicTask() == TLE9563_DEVICEDRIVER_ERRORLOG_BUSY);
    if((s_deviceDriver.u8_deviceDriverErrorLog == TLE9563_DEVICEDRIVER_ERRORLOG_SPI_RECEIVE_ERR) || (TLE9563->SIF.bit.SPI_CRC_FAIL == 1))
    {
      u8_success = 0;
      return u8_success;
    }
  } 
  /* Init Watchdog to close long open window after start up */
  TLE9563_setWdCtrlReg((uint16_t)TLE9563_WD_CTRL);
  TLE9563_deviceDriverCyclicTask();
  while(TLE9563_deviceDriverCyclicTask() == TLE9563_DEVICEDRIVER_ERRORLOG_BUSY);
  /* Final check for SPI error */
  if((s_deviceDriver.u8_deviceDriverErrorLog == TLE9563_DEVICEDRIVER_ERRORLOG_STARTED) && (TLE9563->SIF.bit.SPI_CRC_FAIL == 0))
  {
    u8_success = 1;
  }
  
  return u8_success;
}

/** \brief Get the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t SIF byte
 */
uint8_t TLE9563_getSif(void)
{ 
  return TLE9563->SIF.byte;
}

/** \brief Get the Supply Status bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t Supply Status bit of SIF
 */
uint8_t TLE9563_getSifBitSupplyStatus(void)
{
  return TLE9563->SIF.bit.SUPPLY_STAT;
}

/** \brief Get the Temperature Status bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t Temperature Status bit of SIF
 */
uint8_t TLE9563_getSifBitTempStatus(void)
{
  return TLE9563->SIF.bit.TEMP_STAT;
}

/** \brief Get the Bus Status bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t Bus Status bit of SIF
 */
uint8_t TLE9563_getSifBitBusStatus(void)
{
  return TLE9563->SIF.bit.BUS_STAT;
}

/** \brief Get the Wake Up bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t Wake Up bit of SIF
 */
uint8_t TLE9563_getSifBitWakeUp(void)
{
  return TLE9563->SIF.bit.WAKE_UP;
}

/** \brief Get the High Side Status bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t High Side Status bit of SIF
 */
uint8_t TLE9563_getSifBitHsStatus(void)
{
  return TLE9563->SIF.bit.HS_STAT;
}

/** \brief Get the Device Status bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t Device Status bit of SIF
 */
uint8_t TLE9563_getSifBitDeviceStatus(void)
{
  return TLE9563->SIF.bit.DEV_STAT;
}

/** \brief Get the Bridge Driver Status bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t Bridge Driver Status bit of SIF
 */
uint8_t TLE9563_getSifBitBdrvStatus(void)
{
  return TLE9563->SIF.bit.BD_STAT;
}

/** \brief Get the SPI or CRC Fail bit of the Status Information Field of last SPI message received from the device
 * 
 *  \return uint8_t SPI or CRC Fail bit of SIF
 */
uint8_t TLE9563_getSifBitSpiCrcFail(void)
{
  return TLE9563->SIF.bit.SPI_CRC_FAIL;
}

/** \brief Serve Watchdog
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_serveWatchdog(void)
{
  uint8_t u8_success = 0;
  /* if no set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = TLE9563->WD_CTRL.reg;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Recovery SPI command in case of mismatch of CRC setting between the device and µC
 *  \brief Can only be used, if device is in Normal Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_recoverCrc(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.fp_setReg = &TLE9563_resetCrc;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Reset the last call of a set bitfield function
 * 
 *  \return void no return value
 */
void TLE9563_resetLastSetBitfieldRequest(void)
{
  s_deviceDriver.u16_setBitValue = (uint16_t)0;
  s_deviceDriver.fp_setReg = NULL;
}

/** \brief Set all HBx with one SPI command
 * 
 *  \param e_value HB Mode Register content \ref tBDRV_setAllHbx
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setAllHbx(tBDRV_setAllHbx e_value)
{
  uint8_t u8_success = 0;
  /* if no set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = (uint16_t)e_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

