jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get Mode and Supply Control Register
 * 
 *  \return uint16_t Mode and Supply Control Register
 */
uint16_t TLE9563_getModeSupplyCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->M_S_CTRL.reg;
}

/** \brief Set Mode and Supply Control Register
 * 
 *  \param u16_value Mode and Supply Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setModeSupplyCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setMSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Device Mode Control
 *  \brief Use this function for device mode transitions.
 *  \brief In order to go to Normal Mode, use: TLE9563_setDeviceMode(DEVICE_mode_normal)
 *  \brief In order to go to Stop Mode, use: TLE9563_setDeviceMode(DEVICE_mode_stop)
 *  \brief In order to go to Sleep Mode, use: TLE9563_setDeviceMode(DEVICE_mode_sleep)
 *  \brief In order to perform a software reset (go to Init Mode), use: TLE9563_setDeviceMode(DEVICE_mode_reset)
 *  \brief In case of a software reset, the device driver also resets the control register RAM copy \ref TLE9563_setMSCTRL
 *  
 *  \warning VCC1 of the TLE9563 is turned off in Sleep mode. If VCC1 is used to supply the uC, going to Sleep Mode will turn off the uC.
 *  \warning Going to Sleep Mode can only be done, if a wake up source of the TLE9563 is enabled.
 *  \warning The mode transition Stop -> Sleep is not possible.
 *  \warning The mode transitions Sleep -> Normal or return from Fail Safe are not possible via SPI.
 *  \warning Some control registers are modified by the device after certain mode transistions and under certain conditions, e.g. HW_CTRL, BUS_CTRL, WK_CTRL, WD_CTRL.
 *  \warning Please refer to device user manual and re-initialize according registers, if needed.
 * 
 *  \param e_value Device Mode Control
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setDeviceMode(tDEVICE_mode e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->M_S_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_M_S_CTRL_MODE_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_M_S_CTRL_MODE_Pos) & TLE9563_M_S_CTRL_MODE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setMSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Device Mode Control
 * 
 *  \return uint16_t Device Mode Control
 */
uint16_t TLE9563_getDeviceMode(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->M_S_CTRL.bit.MODE;
}

/** \brief Set Reaction in case of VCC1 Over Voltage
 * 
 *  \param e_value Reaction in case of VCC1 Over Voltage
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVcc1OverVoltReact(tVCC1_overVoltReact e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->M_S_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_M_S_CTRL_VCC1_OV_MOD_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_M_S_CTRL_VCC1_OV_MOD_Pos) & TLE9563_M_S_CTRL_VCC1_OV_MOD_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setMSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Reaction in case of VCC1 Over Voltage
 * 
 *  \return uint16_t Reaction in case of VCC1 Over Voltage
 */
uint16_t TLE9563_getVcc1OverVoltReact(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->M_S_CTRL.bit.VCC1_OV_MOD;
}

/** \brief Set VCC1 Undervoltage Reset Hysteresis Selection (see also Chapter 12.7.1 for more information)
 * 
 *  \param e_value VCC1 Undervoltage Reset Hysteresis Selection (see also Chapter 12.7.1 for more information)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVcc1UnderVoltResetHys(tVCC1_underVoltResetHys e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->M_S_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_M_S_CTRL_RSTN_HYS_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_M_S_CTRL_RSTN_HYS_Pos) & TLE9563_M_S_CTRL_RSTN_HYS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setMSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get VCC1 Undervoltage Reset Hysteresis Selection (see also Chapter 12.7.1 for more information)
 * 
 *  \return uint16_t VCC1 Undervoltage Reset Hysteresis Selection (see also Chapter 12.7.1 for more information)
 */
uint16_t TLE9563_getVcc1UnderVoltResetHys(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->M_S_CTRL.bit.RSTN_HYS;
}

/** \brief Set VCC1 Active Peak Threshold Selection
 * 
 *  \param e_value VCC1 Active Peak Threshold Selection
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVcc1ActPeakThresh(tVCC1_actPeakThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->M_S_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_M_S_CTRL_I_PEAK_TH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_M_S_CTRL_I_PEAK_TH_Pos) & TLE9563_M_S_CTRL_I_PEAK_TH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setMSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

