jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get VCC1 Active Peak Threshold Selection
 * 
 *  \return uint16_t VCC1 Active Peak Threshold Selection
 */
uint16_t TLE9563_getVcc1ActPeakThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->M_S_CTRL.bit.I_PEAK_TH;
}

/** \brief Set VCC1 Reset Threshold Control
 * 
 *  \param e_value VCC1 Reset Threshold Control
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVcc1ResetThresh(tVCC1_resetThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->M_S_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_M_S_CTRL_VCC1_RT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_M_S_CTRL_VCC1_RT_Pos) & TLE9563_M_S_CTRL_VCC1_RT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setMSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get VCC1 Reset Threshold Control
 * 
 *  \return uint16_t VCC1 Reset Threshold Control
 */
uint16_t TLE9563_getVcc1ResetThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->M_S_CTRL.bit.VCC1_RT;
}

/** \brief Get Hardware Control Register
 * 
 *  \return uint16_t Hardware Control Register
 */
uint16_t TLE9563_getHwCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HW_CTRL.reg;
}

/** \brief Set Hardware Control Register
 * 
 *  \param u16_value Hardware Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHwCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set TSD2 minimum Waiting Time Selection
 * 
 *  \param e_value TSD2 minimum Waiting Time Selection
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTempShutDown2MinWaitTime(tTSD2_minWaitTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_TSD2_DEL_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HW_CTRL_TSD2_DEL_Pos) & TLE9563_HW_CTRL_TSD2_DEL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get TSD2 minimum Waiting Time Selection
 * 
 *  \return uint16_t TSD2 minimum Waiting Time Selection
 */
uint16_t TLE9563_getTempShutDown2MinWaitTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HW_CTRL.bit.TSD2_DEL;
}

/** \brief Set VS OV comparator threshold change
 * 
 *  \param e_value VS OV comparator threshold change
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVsOverVoltThresh(tVS_overVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_VS_OV_SEL_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HW_CTRL_VS_OV_SEL_Pos) & TLE9563_HW_CTRL_VS_OV_SEL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get VS OV comparator threshold change
 * 
 *  \return uint16_t VS OV comparator threshold change
 */
uint16_t TLE9563_getVsOverVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HW_CTRL.bit.VS_OV_SEL;
}

/** \brief Enable Sample and hold circuitry disable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvSampleAndHoldCiruit(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_SH_DISABLE_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HW_CTRL_SH_DISABLE_Pos) & TLE9563_HW_CTRL_SH_DISABLE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Sample and hold circuitry disable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvSampleAndHoldCiruit(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_SH_DISABLE_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HW_CTRL_SH_DISABLE_Pos) & TLE9563_HW_CTRL_SH_DISABLE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

