jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief get Sample and hold circuitry disable Enable/Disable Setting
 * 
 *  \return  Sample and hold circuitry disable Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getBdrvSampleAndHoldCiruit(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HW_CTRL.bit.SH_DISABLE;
}

/** \brief Set Reset delay time
 * 
 *  \param e_value Reset delay time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setResetDelayTime(tRST_delayTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_RSTN_DEL_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HW_CTRL_RSTN_DEL_Pos) & TLE9563_HW_CTRL_RSTN_DEL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Reset delay time
 * 
 *  \return uint16_t Reset delay time
 */
uint16_t TLE9563_getResetDelayTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HW_CTRL.bit.RSTN_DEL;
}

/** \brief Set Soft Reset Configuration
 * 
 *  \param e_value Soft Reset Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSoftResetConfig(tSOFTRST_config e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_SOFT_RESET_RO_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HW_CTRL_SOFT_RESET_RO_Pos) & TLE9563_HW_CTRL_SOFT_RESET_RO_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Soft Reset Configuration
 * 
 *  \return uint16_t Soft Reset Configuration
 */
uint16_t TLE9563_getSoftResetConfig(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HW_CTRL.bit.SOFT_RESET_RO;
}

/** \brief Enable Watchdog Deactivation during Stop Mode, bit1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enWdDeactDuringStopModeBit1(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_WD_STM_EN_1_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HW_CTRL_WD_STM_EN_1_Pos) & TLE9563_HW_CTRL_WD_STM_EN_1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Watchdog Deactivation during Stop Mode, bit1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disWdDeactDuringStopModeBit1(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HW_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HW_CTRL_WD_STM_EN_1_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HW_CTRL_WD_STM_EN_1_Pos) & TLE9563_HW_CTRL_WD_STM_EN_1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHWCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Watchdog Deactivation during Stop Mode, bit1 Enable/Disable Setting
 * 
 *  \return  Watchdog Deactivation during Stop Mode, bit1 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getWdDeactDuringStopModeBit1(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HW_CTRL.bit.WD_STM_EN_1;
}

/** \brief Get Watchdog Control Register
 * 
 *  \return uint16_t Watchdog Control Register
 */
uint16_t TLE9563_getWdCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WD_CTRL.reg;
}

/** \brief Set Watchdog Control Register
 * 
 *  \param u16_value Watchdog Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWdCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_paritybit = 0;
  uint16_t u16_wdCtrl_temp;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* calculate checksum bit (even parity) */
    u16_wdCtrl_temp = u16_value;
    while(u16_wdCtrl_temp > (uint16_t)0)
    {
      /* Check if LSB is set*/
      if((u16_wdCtrl_temp & (uint16_t)0x0001) == (uint16_t)0x0001)
      {
        /* Toggle parity bit */
        u16_paritybit = u16_paritybit ^ (uint16_t)0x8000;
      }
      u16_wdCtrl_temp = u16_wdCtrl_temp >> 1;
    }
    /* modify checksum bit */
    if(u16_paritybit)
    {
      u16_value = (uint16_t)((u16_value & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    else
    {
      u16_value = (uint16_t)((u16_value & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Watchdog Setting Check Sum Bit
 * 
 *  \return uint16_t Watchdog Setting Check Sum Bit
 */
uint16_t TLE9563_getWdChecksumBit(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WD_CTRL.bit.CHECKSUM;
}

/** \brief Enable Watchdog Deactivation during Stop Mode, bit0
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enWdDeactDuringStopModeBit0(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  uint16_t u16_paritybit = 0;
  uint16_t u16_wdCtrl_temp;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_WD_STM_EN_0_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_WD_STM_EN_0_Pos) & TLE9563_WD_CTRL_WD_STM_EN_0_Msk));
    /* calculate checksum bit (even parity) */
    u16_wdCtrl_temp = u16_reg_temp;
    while(u16_wdCtrl_temp > (uint16_t)0)
    {
      /* Check if LSB is set*/
      if((u16_wdCtrl_temp & (uint16_t)0x0001) == (uint16_t)0x0001)
      {
        /* Toggle parity bit */
        u16_paritybit = u16_paritybit ^ (uint16_t)0x8000;
      }
      u16_wdCtrl_temp = u16_wdCtrl_temp >> 1;
    }
    /* modify checksum bit */
    if(u16_paritybit)
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    else
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Watchdog Deactivation during Stop Mode, bit0
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disWdDeactDuringStopModeBit0(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  uint16_t u16_paritybit = 0;
  uint16_t u16_wdCtrl_temp;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_WD_STM_EN_0_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_WD_STM_EN_0_Pos) & TLE9563_WD_CTRL_WD_STM_EN_0_Msk));
    /* calculate checksum bit (even parity) */
    u16_wdCtrl_temp = u16_reg_temp;
    while(u16_wdCtrl_temp > (uint16_t)0)
    {
      /* Check if LSB is set*/
      if((u16_wdCtrl_temp & (uint16_t)0x0001) == (uint16_t)0x0001)
      {
        /* Toggle parity bit */
        u16_paritybit = u16_paritybit ^ (uint16_t)0x8000;
      }
      u16_wdCtrl_temp = u16_wdCtrl_temp >> 1;
    }
    /* modify checksum bit */
    if(u16_paritybit)
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    else
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

