jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief get Watchdog Deactivation during Stop Mode, bit0 Enable/Disable Setting
 * 
 *  \return  Watchdog Deactivation during Stop Mode, bit0 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getWdDeactDuringStopModeBit0(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WD_CTRL.bit.WD_STM_EN_0;
}

/** \brief Set Watchdog Configuration
 * 
 *  \param e_value Watchdog Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWdConfig(tWD_config e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  uint16_t u16_paritybit = 0;
  uint16_t u16_wdCtrl_temp;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_WD_CFG_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_WD_CTRL_WD_CFG_Pos) & TLE9563_WD_CTRL_WD_CFG_Msk));
    /* calculate checksum bit (even parity) */
    u16_wdCtrl_temp = u16_reg_temp;
    while(u16_wdCtrl_temp > (uint16_t)0)
    {
      /* Check if LSB is set*/
      if((u16_wdCtrl_temp & (uint16_t)0x0001) == (uint16_t)0x0001)
      {
        /* Toggle parity bit */
        u16_paritybit = u16_paritybit ^ (uint16_t)0x8000;
      }
      u16_wdCtrl_temp = u16_wdCtrl_temp >> 1;
    }
    /* modify checksum bit */
    if(u16_paritybit)
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    else
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Watchdog Configuration
 * 
 *  \return uint16_t Watchdog Configuration
 */
uint16_t TLE9563_getWdConfig(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WD_CTRL.bit.WD_CFG;
}

/** \brief Enable Watchdog Enable after Bus Wake in Stop Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enWdAfterBusWkInStopMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  uint16_t u16_paritybit = 0;
  uint16_t u16_wdCtrl_temp;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_WD_EN_WK_BUS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_WD_EN_WK_BUS_Pos) & TLE9563_WD_CTRL_WD_EN_WK_BUS_Msk));
    /* calculate checksum bit (even parity) */
    u16_wdCtrl_temp = u16_reg_temp;
    while(u16_wdCtrl_temp > (uint16_t)0)
    {
      /* Check if LSB is set*/
      if((u16_wdCtrl_temp & (uint16_t)0x0001) == (uint16_t)0x0001)
      {
        /* Toggle parity bit */
        u16_paritybit = u16_paritybit ^ (uint16_t)0x8000;
      }
      u16_wdCtrl_temp = u16_wdCtrl_temp >> 1;
    }
    /* modify checksum bit */
    if(u16_paritybit)
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    else
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Watchdog Enable after Bus Wake in Stop Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disWdAfterBusWkInStopMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  uint16_t u16_paritybit = 0;
  uint16_t u16_wdCtrl_temp;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_WD_EN_WK_BUS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_WD_EN_WK_BUS_Pos) & TLE9563_WD_CTRL_WD_EN_WK_BUS_Msk));
    /* calculate checksum bit (even parity) */
    u16_wdCtrl_temp = u16_reg_temp;
    while(u16_wdCtrl_temp > (uint16_t)0)
    {
      /* Check if LSB is set*/
      if((u16_wdCtrl_temp & (uint16_t)0x0001) == (uint16_t)0x0001)
      {
        /* Toggle parity bit */
        u16_paritybit = u16_paritybit ^ (uint16_t)0x8000;
      }
      u16_wdCtrl_temp = u16_wdCtrl_temp >> 1;
    }
    /* modify checksum bit */
    if(u16_paritybit)
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    else
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Watchdog Enable after Bus Wake in Stop Mode Enable/Disable Setting
 * 
 *  \return  Watchdog Enable after Bus Wake in Stop Mode Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getWdAfterBusWkInStopMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WD_CTRL.bit.WD_EN_WK_BUS;
}

/** \brief Set Watchdog Timer Period
 * 
 *  \param e_value Watchdog Timer Period
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWdTimerPeriod(tWD_timerPeriod e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  uint16_t u16_paritybit = 0;
  uint16_t u16_wdCtrl_temp;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_WD_TIMER_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_WD_CTRL_WD_TIMER_Pos) & TLE9563_WD_CTRL_WD_TIMER_Msk));
    /* calculate checksum bit (even parity) */
    u16_wdCtrl_temp = u16_reg_temp;
    while(u16_wdCtrl_temp > (uint16_t)0)
    {
      /* Check if LSB is set*/
      if((u16_wdCtrl_temp & (uint16_t)0x0001) == (uint16_t)0x0001)
      {
        /* Toggle parity bit */
        u16_paritybit = u16_paritybit ^ (uint16_t)0x8000;
      }
      u16_wdCtrl_temp = u16_wdCtrl_temp >> 1;
    }
    /* modify checksum bit */
    if(u16_paritybit)
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    else
    {
      u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WD_CTRL_CHECKSUM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WD_CTRL_CHECKSUM_Pos) & TLE9563_WD_CTRL_CHECKSUM_Msk));
    }
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Watchdog Timer Period
 * 
 *  \return uint16_t Watchdog Timer Period
 */
uint16_t TLE9563_getWdTimerPeriod(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WD_CTRL.bit.WD_TIMER;
}

/** \brief Get CAN Control Register
 * 
 *  \return uint16_t CAN Control Register
 */
uint16_t TLE9563_getBusCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->BUS_CTRL.reg;
}

