jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set CAN Control Register
 * 
 *  \param u16_value CAN Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBusCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setBUSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set HS-CAN Module Modes
 * 
 *  \param e_value HS-CAN Module Modes
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCanMode(tCAN_mode e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BUS_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BUS_CTRL_CAN_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_BUS_CTRL_CAN_Pos) & TLE9563_BUS_CTRL_CAN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBUSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get HS-CAN Module Modes
 * 
 *  \return uint16_t HS-CAN Module Modes
 */
uint16_t TLE9563_getCanMode(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->BUS_CTRL.bit.CAN;
}

/** \brief Get Wake-up Control Register
 * 
 *  \return uint16_t Wake-up Control Register
 */
uint16_t TLE9563_getWk4CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_CTRL_BNK3.reg;
}

/** \brief Set Wake-up Control Register
 * 
 *  \param u16_value Wake-up Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWk4CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Wake-up Filter Time Configuration
 * 
 *  \param e_value Wake-up Filter Time Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWk4FiltTime(tWK_filtTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK3.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK3_WK_FILT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_WK_CTRL_BNK3_WK_FILT_Pos) & TLE9563_WK_CTRL_BNK3_WK_FILT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Wake-up Filter Time Configuration
 * 
 *  \return uint16_t Wake-up Filter Time Configuration
 */
uint16_t TLE9563_getWk4FiltTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_CTRL_BNK3.bit.WK_FILT;
}

/** \brief Set WKx Pull-Up/Pull-Down Configuration
 * 
 *  \param e_value WKx Pull-Up/Pull-Down Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWk4PullUpPullDown(tWK_pullUpPullDown e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK3.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK3_WK_PUPD_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_WK_CTRL_BNK3_WK_PUPD_Pos) & TLE9563_WK_CTRL_BNK3_WK_PUPD_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WKx Pull-Up/Pull-Down Configuration
 * 
 *  \return uint16_t WKx Pull-Up/Pull-Down Configuration
 */
uint16_t TLE9563_getWk4PullUpPullDown(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_CTRL_BNK3.bit.WK_PUPD;
}

/** \brief Enable WKx Enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enWk4(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK3.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK3_WK_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WK_CTRL_BNK3_WK_EN_Pos) & TLE9563_WK_CTRL_BNK3_WK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WKx Enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disWk4(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK3.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK3_WK_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WK_CTRL_BNK3_WK_EN_Pos) & TLE9563_WK_CTRL_BNK3_WK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WKx Enable Enable/Disable Setting
 * 
 *  \return  WKx Enable Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getWk4(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_CTRL_BNK3.bit.WK_EN;
}

/** \brief Get Wake-up Control Register
 * 
 *  \return uint16_t Wake-up Control Register
 */
uint16_t TLE9563_getWk5CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_CTRL_BNK4.reg;
}

/** \brief Set Wake-up Control Register
 * 
 *  \param u16_value Wake-up Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWk5CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK4;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Wake-up Filter Time Configuration
 * 
 *  \param e_value Wake-up Filter Time Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWk5FiltTime(tWK_filtTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK4.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK4_WK_FILT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_WK_CTRL_BNK4_WK_FILT_Pos) & TLE9563_WK_CTRL_BNK4_WK_FILT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK4;
    u8_success = 1;
  }
  return u8_success;
}

