jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get Wake-up Filter Time Configuration
 * 
 *  \return uint16_t Wake-up Filter Time Configuration
 */
uint16_t TLE9563_getWk5FiltTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_CTRL_BNK4.bit.WK_FILT;
}

/** \brief Set WKx Pull-Up/Pull-Down Configuration
 * 
 *  \param e_value WKx Pull-Up/Pull-Down Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setWk5PullUpPullDown(tWK_pullUpPullDown e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK4.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK4_WK_PUPD_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_WK_CTRL_BNK4_WK_PUPD_Pos) & TLE9563_WK_CTRL_BNK4_WK_PUPD_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK4;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WKx Pull-Up/Pull-Down Configuration
 * 
 *  \return uint16_t WKx Pull-Up/Pull-Down Configuration
 */
uint16_t TLE9563_getWk5PullUpPullDown(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_CTRL_BNK4.bit.WK_PUPD;
}

/** \brief Enable WKx Enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enWk5(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK4.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK4_WK_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_WK_CTRL_BNK4_WK_EN_Pos) & TLE9563_WK_CTRL_BNK4_WK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK4;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WKx Enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disWk5(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->WK_CTRL_BNK4.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_WK_CTRL_BNK4_WK_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_WK_CTRL_BNK4_WK_EN_Pos) & TLE9563_WK_CTRL_BNK4_WK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setWKCTRLBNK4;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WKx Enable Enable/Disable Setting
 * 
 *  \return  WKx Enable Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getWk5(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_CTRL_BNK4.bit.WK_EN;
}

/** \brief Get Timer 1 and Timer2 Control and Selection Register
 * 
 *  \return uint16_t Timer 1 and Timer2 Control and Selection Register
 */
uint16_t TLE9563_getTimerCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TIMER_CTRL.reg;
}

/** \brief Set Timer 1 and Timer2 Control and Selection Register
 * 
 *  \param u16_value Timer 1 and Timer2 Control and Selection Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTimerCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTIMERCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Timer2 On-Time Configuration
 * 
 *  \param e_value Timer2 On-Time Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTimer2OnTime(tTIMER_onTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TIMER_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TIMER_CTRL_TIMER2_ON_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TIMER_CTRL_TIMER2_ON_Pos) & TLE9563_TIMER_CTRL_TIMER2_ON_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTIMERCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Timer2 On-Time Configuration
 * 
 *  \return uint16_t Timer2 On-Time Configuration
 */
uint16_t TLE9563_getTimer2OnTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TIMER_CTRL.bit.TIMER2_ON;
}

/** \brief Set Timer2 Period Configuration
 * 
 *  \param e_value Timer2 Period Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTimer2Period(tTIMER_period e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TIMER_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TIMER_CTRL_TIMER2_PER_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TIMER_CTRL_TIMER2_PER_Pos) & TLE9563_TIMER_CTRL_TIMER2_PER_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTIMERCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Timer2 Period Configuration
 * 
 *  \return uint16_t Timer2 Period Configuration
 */
uint16_t TLE9563_getTimer2Period(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TIMER_CTRL.bit.TIMER2_PER;
}

/** \brief Set Cyclic Wake Configuration
 * 
 *  \param e_value Cyclic Wake Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTimerCyclicWk(tTIMER_cyclicWk e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TIMER_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TIMER_CTRL_CYCWK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TIMER_CTRL_CYCWK_Pos) & TLE9563_TIMER_CTRL_CYCWK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTIMERCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Cyclic Wake Configuration
 * 
 *  \return uint16_t Cyclic Wake Configuration
 */
uint16_t TLE9563_getTimerCyclicWk(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TIMER_CTRL.bit.CYCWK;
}

/** \brief Set Timer1 On-Time Configuration
 * 
 *  \param e_value Timer1 On-Time Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTimer1OnTime(tTIMER_onTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TIMER_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TIMER_CTRL_TIMER1_ON_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TIMER_CTRL_TIMER1_ON_Pos) & TLE9563_TIMER_CTRL_TIMER1_ON_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTIMERCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Timer1 On-Time Configuration
 * 
 *  \return uint16_t Timer1 On-Time Configuration
 */
uint16_t TLE9563_getTimer1OnTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TIMER_CTRL.bit.TIMER1_ON;
}

/** \brief Set Timer1 Period Configuration
 * 
 *  \param e_value Timer1 Period Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTimer1Period(tTIMER_period e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TIMER_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TIMER_CTRL_TIMER1_PER_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TIMER_CTRL_TIMER1_PER_Pos) & TLE9563_TIMER_CTRL_TIMER1_PER_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTIMERCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Timer1 Period Configuration
 * 
 *  \return uint16_t Timer1 Period Configuration
 */
uint16_t TLE9563_getTimer1Period(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TIMER_CTRL.bit.TIMER1_PER;
}

/** \brief Get High-Side Switch Shutdown Control Register
 * 
 *  \return uint16_t High-Side Switch Shutdown Control Register
 */
uint16_t TLE9563_getHsSwitchShutdownCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SW_SD_CTRL.reg;
}

/** \brief Set High-Side Switch Shutdown Control Register
 * 
 *  \param u16_value High-Side Switch Shutdown Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHsSwitchShutdownCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

