jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set Switch recovery after removal of VS Overvoltage for HS3
 * 
 *  \param e_value Switch recovery after removal of VS Overvoltage for HS3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHs3VsOverVoltRecovery(tHS_vsOverVoltRecovery e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS3_OV_REC_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SW_SD_CTRL_HS3_OV_REC_Pos) & TLE9563_SW_SD_CTRL_HS3_OV_REC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Switch recovery after removal of VS Overvoltage for HS3
 * 
 *  \return uint16_t Switch recovery after removal of VS Overvoltage for HS3
 */
uint16_t TLE9563_getHs3VsOverVoltRecovery(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SW_SD_CTRL.bit.HS3_OV_REC;
}

/** \brief Set Switch recovery after removal of VS Overvoltage for HS2
 * 
 *  \param e_value Switch recovery after removal of VS Overvoltage for HS2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHs2VsOverVoltRecovery(tHS_vsOverVoltRecovery e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS2_OV_REC_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SW_SD_CTRL_HS2_OV_REC_Pos) & TLE9563_SW_SD_CTRL_HS2_OV_REC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Switch recovery after removal of VS Overvoltage for HS2
 * 
 *  \return uint16_t Switch recovery after removal of VS Overvoltage for HS2
 */
uint16_t TLE9563_getHs2VsOverVoltRecovery(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SW_SD_CTRL.bit.HS2_OV_REC;
}

/** \brief Set Switch recovery after removal of VS Overvoltage for HS1
 * 
 *  \param e_value Switch recovery after removal of VS Overvoltage for HS1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHs1VsOverVoltRecovery(tHS_vsOverVoltRecovery e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS1_OV_REC_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SW_SD_CTRL_HS1_OV_REC_Pos) & TLE9563_SW_SD_CTRL_HS1_OV_REC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Switch recovery after removal of VS Overvoltage for HS1
 * 
 *  \return uint16_t Switch recovery after removal of VS Overvoltage for HS1
 */
uint16_t TLE9563_getHs1VsOverVoltRecovery(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SW_SD_CTRL.bit.HS1_OV_REC;
}

/** \brief Enable Shutdown Disabling of all HS in case of Overtemperature event
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enHsxOverTempShutDownAll(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Pos) & TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Shutdown Disabling of all HS in case of Overtemperature event
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disHsxOverTempShutDownAll(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Pos) & TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Shutdown Disabling of all HS in case of Overtemperature event Enable/Disable Setting
 * 
 *  \return  Shutdown Disabling of all HS in case of Overtemperature event Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getHsxOverTempShutDownAll(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SW_SD_CTRL.bit.HS_OT_SD_DIS;
}

/** \brief Enable Shutdown Disabling of HS3 in case of input supply overvoltage in Normal Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enHs3VsOverVoltShutDownNormalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Pos) & TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Shutdown Disabling of HS3 in case of input supply overvoltage in Normal Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disHs3VsOverVoltShutDownNormalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Pos) & TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Shutdown Disabling of HS3 in case of input supply overvoltage in Normal Mode Enable/Disable Setting
 * 
 *  \return  Shutdown Disabling of HS3 in case of input supply overvoltage in Normal Mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getHs3VsOverVoltShutDownNormalMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SW_SD_CTRL.bit.HS3_OV_SDN_DIS;
}

