jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Enable Shutdown Disabling of HS2 in case of input supply overvoltage in Normal Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enHs2VsOverVoltShutDownNormalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Pos) & TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Shutdown Disabling of HS2 in case of input supply overvoltage in Normal Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disHs2VsOverVoltShutDownNormalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Pos) & TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Shutdown Disabling of HS2 in case of input supply overvoltage in Normal Mode Enable/Disable Setting
 * 
 *  \return  Shutdown Disabling of HS2 in case of input supply overvoltage in Normal Mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getHs2VsOverVoltShutDownNormalMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SW_SD_CTRL.bit.HS2_OV_SDN_DIS;
}

/** \brief Enable Shutdown Disabling of HS1 in case of input supply overvoltage in Normal Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enHs1VsOverVoltShutDownNormalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Pos) & TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Shutdown Disabling of HS1 in case of input supply overvoltage in Normal Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disHs1VsOverVoltShutDownNormalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Pos) & TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Shutdown Disabling of HS1 in case of input supply overvoltage in Normal Mode Enable/Disable Setting
 * 
 *  \return  Shutdown Disabling of HS1 in case of input supply overvoltage in Normal Mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getHs1VsOverVoltShutDownNormalMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SW_SD_CTRL.bit.HS1_OV_SDN_DIS;
}

/** \brief Enable Shutdown Disabling of HSx in case of input supply overvoltage in Stop Mode or Sleep Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enHsxVsOverVoltShutDownStopModeSleepMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Pos) & TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Shutdown Disabling of HSx in case of input supply overvoltage in Stop Mode or Sleep Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disHsxVsOverVoltShutDownStopModeSleepMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Pos) & TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Shutdown Disabling of HSx in case of input supply overvoltage in Stop Mode or Sleep Mode Enable/Disable Setting
 * 
 *  \return  Shutdown Disabling of HSx in case of input supply overvoltage in Stop Mode or Sleep Mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getHsxVsOverVoltShutDownStopModeSleepMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SW_SD_CTRL.bit.HS_OV_SDS_DIS;
}

/** \brief Enable Shutdown Disabling of HSx in case of input supply undervoltage
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enHsxVsUnderVoltShutDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Pos) & TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

