jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Disable Shutdown Disabling of HSx in case of input supply undervoltage
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disHsxVsUnderVoltShutDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Pos) & TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Shutdown Disabling of HSx in case of input supply undervoltage Enable/Disable Setting
 * 
 *  \return  Shutdown Disabling of HSx in case of input supply undervoltage Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getHsxVsUnderVoltShutDown(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SW_SD_CTRL.bit.HS_UV_SD_DIS;
}

/** \brief Set Switch recovery after removal of Undervoltage for HSx
 * 
 *  \param e_value Switch recovery after removal of Undervoltage for HSx
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHsxVsUnderVoltRecovery(tHS_vsUnderVoltRecovery e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SW_SD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SW_SD_CTRL_HS_UV_REC_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SW_SD_CTRL_HS_UV_REC_Pos) & TLE9563_SW_SD_CTRL_HS_UV_REC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWSDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Switch recovery after removal of Undervoltage for HSx
 * 
 *  \return uint16_t Switch recovery after removal of Undervoltage for HSx
 */
uint16_t TLE9563_getHsxVsUnderVoltRecovery(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SW_SD_CTRL.bit.HS_UV_REC;
}

/** \brief Get High-Side Switch Control Register
 * 
 *  \return uint16_t High-Side Switch Control Register
 */
uint16_t TLE9563_getHsCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_CTRL.reg;
}

/** \brief Set High-Side Switch Control Register
 *  \brief The desired duty cycle should be set first in according PWM_CTRL register before the HSx is enabled as PWM.
 * 
 *  \param u16_value High-Side Switch Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHsCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set HS3 Configuration
 *  \brief The desired duty cycle should be set first in according PWM_CTRL register before the HSx is enabled as PWM.
 * 
 *  \param e_value HS3 Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHs3Config(tHS_config e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_CTRL_HS3_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HS_CTRL_HS3_Pos) & TLE9563_HS_CTRL_HS3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get HS3 Configuration
 * 
 *  \return uint16_t HS3 Configuration
 */
uint16_t TLE9563_getHs3Config(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_CTRL.bit.HS3;
}

/** \brief Set HS2 Configuration
 *  \brief The desired duty cycle should be set first in according PWM_CTRL register before the HSx is enabled as PWM.
 * 
 *  \param e_value HS2 Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHs2Config(tHS_config e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_CTRL_HS2_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HS_CTRL_HS2_Pos) & TLE9563_HS_CTRL_HS2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get HS2 Configuration
 * 
 *  \return uint16_t HS2 Configuration
 */
uint16_t TLE9563_getHs2Config(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_CTRL.bit.HS2;
}

/** \brief Set HS1 Configuration
 *  \brief The desired duty cycle should be set first in according PWM_CTRL register before the HSx is enabled as PWM.
 * 
 *  \param e_value HS1 Configuration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHs1Config(tHS_config e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_CTRL_HS1_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HS_CTRL_HS1_Pos) & TLE9563_HS_CTRL_HS1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get HS1 Configuration
 * 
 *  \return uint16_t HS1 Configuration
 */
uint16_t TLE9563_getHs1Config(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_CTRL.bit.HS1;
}

