jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get Interrupt Mask Control Register
 * 
 *  \return uint16_t Interrupt Mask Control Register
 */
uint16_t TLE9563_getIntrMaskCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->INT_MASK.reg;
}

/** \brief Set Interrupt Mask Control Register
 * 
 *  \param u16_value Interrupt Mask Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setIntrMaskCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Enable Periodical INTN generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnPeriodical(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_INTN_CYC_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_INTN_CYC_EN_Pos) & TLE9563_INT_MASK_INTN_CYC_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Periodical INTN generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnPeriodical(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_INTN_CYC_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_INTN_CYC_EN_Pos) & TLE9563_INT_MASK_INTN_CYC_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Periodical INTN generation Enable/Disable Setting
 * 
 *  \return  Periodical INTN generation Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnPeriodical(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.INTN_CYC_EN;
}

/** \brief Enable Disable Watchdog in Software Development Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enWdInSoftDevMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_WD_SDM_DISABLE_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_WD_SDM_DISABLE_Pos) & TLE9563_INT_MASK_WD_SDM_DISABLE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Disable Watchdog in Software Development Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disWdInSoftDevMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_WD_SDM_DISABLE_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_WD_SDM_DISABLE_Pos) & TLE9563_INT_MASK_WD_SDM_DISABLE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Disable Watchdog in Software Development Mode Enable/Disable Setting
 * 
 *  \return  Disable Watchdog in Software Development Mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getWdInSoftDevMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.WD_SDM_DISABLE;
}

/** \brief Enable Watchdog failure in Software Development Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnWdFail(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_WD_SDM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_WD_SDM_Pos) & TLE9563_INT_MASK_WD_SDM_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Watchdog failure in Software Development Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnWdFail(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_WD_SDM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_WD_SDM_Pos) & TLE9563_INT_MASK_WD_SDM_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

