jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief get Watchdog failure in Software Development Mode Enable/Disable Setting
 * 
 *  \return  Watchdog failure in Software Development Mode Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnWdFail(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.WD_SDM;
}

/** \brief Enable SPI and CRC interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnSpiFailOrCrcFail(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_SPI_CRC_FAIL_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_SPI_CRC_FAIL_Pos) & TLE9563_INT_MASK_SPI_CRC_FAIL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable SPI and CRC interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnSpiFailOrCrcFail(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_SPI_CRC_FAIL_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_SPI_CRC_FAIL_Pos) & TLE9563_INT_MASK_SPI_CRC_FAIL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get SPI and CRC interrupt generation Enable/Disable Setting
 * 
 *  \return  SPI and CRC interrupt generation Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnSpiFailOrCrcFail(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.SPI_CRC_FAIL;
}

/** \brief Enable Bridge Driver Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnBdrvStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_BD_STAT_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_BD_STAT_Pos) & TLE9563_INT_MASK_BD_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Bridge Driver Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnBdrvStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_BD_STAT_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_BD_STAT_Pos) & TLE9563_INT_MASK_BD_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Bridge Driver Interrupt generation Enable/Disable Setting
 * 
 *  \return  Bridge Driver Interrupt generation Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnBdrvStat(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.BD_STAT;
}

/** \brief Enable High Side Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnHsStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_HS_STAT_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_HS_STAT_Pos) & TLE9563_INT_MASK_HS_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable High Side Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnHsStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_HS_STAT_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_HS_STAT_Pos) & TLE9563_INT_MASK_HS_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get High Side Interrupt generation Enable/Disable Setting
 * 
 *  \return  High Side Interrupt generation Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnHsStat(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.HS_STAT;
}

/** \brief Enable BUS Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnBusStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_BUS_STAT_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_BUS_STAT_Pos) & TLE9563_INT_MASK_BUS_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable BUS Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnBusStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_BUS_STAT_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_BUS_STAT_Pos) & TLE9563_INT_MASK_BUS_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get BUS Interrupt generation Enable/Disable Setting
 * 
 *  \return  BUS Interrupt generation Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnBusStat(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.BUS_STAT;
}

/** \brief Enable Temperature Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnTempStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_TEMP_STAT_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_TEMP_STAT_Pos) & TLE9563_INT_MASK_TEMP_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Temperature Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnTempStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_TEMP_STAT_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_TEMP_STAT_Pos) & TLE9563_INT_MASK_TEMP_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Temperature Interrupt generation Enable/Disable Setting
 * 
 *  \return  Temperature Interrupt generation Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnTempStat(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.TEMP_STAT;
}

/** \brief Enable SUPPLY Status Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enIntnSupplyStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_SUPPLY_STAT_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_INT_MASK_SUPPLY_STAT_Pos) & TLE9563_INT_MASK_SUPPLY_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable SUPPLY Status Interrupt generation
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disIntnSupplyStat(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->INT_MASK.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_INT_MASK_SUPPLY_STAT_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_INT_MASK_SUPPLY_STAT_Pos) & TLE9563_INT_MASK_SUPPLY_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setINTMASK;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get SUPPLY Status Interrupt generation Enable/Disable Setting
 * 
 *  \return  SUPPLY Status Interrupt generation Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getIntnSupplyStat(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->INT_MASK.bit.SUPPLY_STAT;
}

/** \brief Get PWM Configuration Control Register
 * 
 *  \return uint16_t PWM Configuration Control Register
 */
uint16_t TLE9563_getPwm1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK0.reg;
}

