jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set PWM Configuration Control Register
 * 
 *  \param u16_value PWM Configuration Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set PWM generator Frequency Setting
 * 
 *  \param e_value PWM generator Frequency Setting
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm1Freq(tPWM_freq e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK0_PWM_FREQ_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_PWM_CTRL_BNK0_PWM_FREQ_Pos) & TLE9563_PWM_CTRL_BNK0_PWM_FREQ_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM generator Frequency Setting
 * 
 *  \return uint16_t PWM generator Frequency Setting
 */
uint16_t TLE9563_getPwm1Freq(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK0.bit.PWM_FREQ;
}

/** \brief Set PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \param u16_value PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm1DutyCycle(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK0_PWM_DC_Msk)) | (((uint16_t)u16_value << (uint16_t)TLE9563_PWM_CTRL_BNK0_PWM_DC_Pos) & TLE9563_PWM_CTRL_BNK0_PWM_DC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint16_t PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 */
uint16_t TLE9563_getPwm1DutyCycle(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK0.bit.PWM_DC;
}

/** \brief Get PWM Configuration Control Register
 * 
 *  \return uint16_t PWM Configuration Control Register
 */
uint16_t TLE9563_getPwm2CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK1.reg;
}

/** \brief Set PWM Configuration Control Register
 * 
 *  \param u16_value PWM Configuration Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm2CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set PWM generator Frequency Setting
 * 
 *  \param e_value PWM generator Frequency Setting
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm2Freq(tPWM_freq e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK1_PWM_FREQ_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_PWM_CTRL_BNK1_PWM_FREQ_Pos) & TLE9563_PWM_CTRL_BNK1_PWM_FREQ_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM generator Frequency Setting
 * 
 *  \return uint16_t PWM generator Frequency Setting
 */
uint16_t TLE9563_getPwm2Freq(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK1.bit.PWM_FREQ;
}

/** \brief Set PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \param u16_value PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm2DutyCycle(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK1_PWM_DC_Msk)) | (((uint16_t)u16_value << (uint16_t)TLE9563_PWM_CTRL_BNK1_PWM_DC_Pos) & TLE9563_PWM_CTRL_BNK1_PWM_DC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint16_t PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 */
uint16_t TLE9563_getPwm2DutyCycle(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK1.bit.PWM_DC;
}

/** \brief Get PWM Configuration Control Register
 * 
 *  \return uint16_t PWM Configuration Control Register
 */
uint16_t TLE9563_getPwm3CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK2.reg;
}

