jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set PWM Configuration Control Register
 * 
 *  \param u16_value PWM Configuration Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm3CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set PWM generator Frequency Setting
 * 
 *  \param e_value PWM generator Frequency Setting
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm3Freq(tPWM_freq e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK2.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK2_PWM_FREQ_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_PWM_CTRL_BNK2_PWM_FREQ_Pos) & TLE9563_PWM_CTRL_BNK2_PWM_FREQ_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM generator Frequency Setting
 * 
 *  \return uint16_t PWM generator Frequency Setting
 */
uint16_t TLE9563_getPwm3Freq(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK2.bit.PWM_FREQ;
}

/** \brief Set PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \param u16_value PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm3DutyCycle(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK2.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK2_PWM_DC_Msk)) | (((uint16_t)u16_value << (uint16_t)TLE9563_PWM_CTRL_BNK2_PWM_DC_Pos) & TLE9563_PWM_CTRL_BNK2_PWM_DC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint16_t PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 */
uint16_t TLE9563_getPwm3DutyCycle(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK2.bit.PWM_DC;
}

/** \brief Get PWM Configuration Control Register
 * 
 *  \return uint16_t PWM Configuration Control Register
 */
uint16_t TLE9563_getPwm4CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK3.reg;
}

/** \brief Set PWM Configuration Control Register
 * 
 *  \param u16_value PWM Configuration Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm4CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set PWM generator Frequency Setting
 * 
 *  \param e_value PWM generator Frequency Setting
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm4Freq(tPWM_freq e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK3.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK3_PWM_FREQ_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_PWM_CTRL_BNK3_PWM_FREQ_Pos) & TLE9563_PWM_CTRL_BNK3_PWM_FREQ_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM generator Frequency Setting
 * 
 *  \return uint16_t PWM generator Frequency Setting
 */
uint16_t TLE9563_getPwm4Freq(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK3.bit.PWM_FREQ;
}

/** \brief Set PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \param u16_value PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPwm4DutyCycle(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->PWM_CTRL_BNK3.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_PWM_CTRL_BNK3_PWM_DC_Msk)) | (((uint16_t)u16_value << (uint16_t)TLE9563_PWM_CTRL_BNK3_PWM_DC_Pos) & TLE9563_PWM_CTRL_BNK3_PWM_DC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setPWMCTRLBNK3;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 * 
 *  \return uint16_t PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) 
 */
uint16_t TLE9563_getPwm4DutyCycle(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->PWM_CTRL_BNK3.bit.PWM_DC;
}

/** \brief Set System Status Control (bit0=LSB; bit15=MSB) Dedicated bytes for system configuration, access only by microcontroller. Cleared after power up and soft reset.
 * 
 *  \param u16_value System Status Control (bit0=LSB; bit15=MSB) Dedicated bytes for system configuration, access only by microcontroller. Cleared after power up and soft reset.
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSysStatCtrl(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SYS_STAT_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SYS_STAT_CTRL_SYS_STAT_Msk)) | (((uint16_t)u16_value << (uint16_t)TLE9563_SYS_STAT_CTRL_SYS_STAT_Pos) & TLE9563_SYS_STAT_CTRL_SYS_STAT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSYSSTATCTRL;
    u8_success = 1;
  }
  return u8_success;
}

