jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get System Status Control (bit0=LSB; bit15=MSB) Dedicated bytes for system configuration, access only by microcontroller. Cleared after power up and soft reset.
 * 
 *  \return uint16_t System Status Control (bit0=LSB; bit15=MSB) Dedicated bytes for system configuration, access only by microcontroller. Cleared after power up and soft reset.
 */
uint16_t TLE9563_getSysStatCtrl(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SYS_STAT_CTRL.bit.SYS_STAT;
}

/** \brief Get General Bridge Control Register
 * 
 *  \return uint16_t General Bridge Control Register
 */
uint16_t TLE9563_getGenBridgeCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GENCTRL.reg;
}

/** \brief Set General Bridge Control Register
 * 
 *  \param u16_value General Bridge Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setGenBridgeCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Bridge driver synchronization frequency
 * 
 *  \param e_value Bridge driver synchronization frequency
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvFreq(tBDRV_freq e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_BDFREQ_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_GENCTRL_BDFREQ_Pos) & TLE9563_GENCTRL_BDFREQ_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Bridge driver synchronization frequency
 * 
 *  \return uint16_t Bridge driver synchronization frequency
 */
uint16_t TLE9563_getBdrvFreq(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GENCTRL.bit.BDFREQ;
}

/** \brief Set Charge pump under voltage (referred to VS)
 * 
 *  \param e_value Charge pump under voltage (referred to VS)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCpUnderVoltThresh(tCP_underVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_CPUVTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_GENCTRL_CPUVTH_Pos) & TLE9563_GENCTRL_CPUVTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Charge pump under voltage (referred to VS)
 * 
 *  \return uint16_t Charge pump under voltage (referred to VS)
 */
uint16_t TLE9563_getCpUnderVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GENCTRL.bit.CPUVTH;
}

/** \brief Set External MOSFET normal / logic level selection
 * 
 *  \param e_value External MOSFET normal / logic level selection
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvExtMosfetLvl(tBDRV_extMosfetLvl e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_FET_LVL_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_GENCTRL_FET_LVL_Pos) & TLE9563_GENCTRL_FET_LVL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get External MOSFET normal / logic level selection
 * 
 *  \return uint16_t External MOSFET normal / logic level selection
 */
uint16_t TLE9563_getBdrvExtMosfetLvl(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GENCTRL.bit.FET_LVL;
}

/** \brief Enable Automatic switchover between dual and single charge pump stage
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCpAutoSwitchBetweenDualAndSingleStage(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_CPSTGA_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_GENCTRL_CPSTGA_Pos) & TLE9563_GENCTRL_CPSTGA_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Automatic switchover between dual and single charge pump stage
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCpAutoSwitchBetweenDualAndSingleStage(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_CPSTGA_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_GENCTRL_CPSTGA_Pos) & TLE9563_GENCTRL_CPSTGA_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Automatic switchover between dual and single charge pump stage Enable/Disable Setting
 * 
 *  \return  Automatic switchover between dual and single charge pump stage Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCpAutoSwitchBetweenDualAndSingleStage(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GENCTRL.bit.CPSTGA;
}

