jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Enable Bridge driver recover from VS and VSINT Overvoltage
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvVsVsintOverVoltRecovery(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_BDOV_REC_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_GENCTRL_BDOV_REC_Pos) & TLE9563_GENCTRL_BDOV_REC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Bridge driver recover from VS and VSINT Overvoltage
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvVsVsintOverVoltRecovery(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_BDOV_REC_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_GENCTRL_BDOV_REC_Pos) & TLE9563_GENCTRL_BDOV_REC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Bridge driver recover from VS and VSINT Overvoltage Enable/Disable Setting
 * 
 *  \return  Bridge driver recover from VS and VSINT Overvoltage Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvVsVsintOverVoltRecovery(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GENCTRL.bit.BDOV_REC;
}

/** \brief Set Adaptation of the pre-charge and pre-discharge current
 * 
 *  \param e_value Adaptation of the pre-charge and pre-discharge current
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvPreChargePreDischargeCurAdaption(tBDRV_preChargePreDischargeCurAdaption e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_IPCHGADT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_GENCTRL_IPCHGADT_Pos) & TLE9563_GENCTRL_IPCHGADT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Adaptation of the pre-charge and pre-discharge current
 * 
 *  \return uint16_t Adaptation of the pre-charge and pre-discharge current
 */
uint16_t TLE9563_getBdrvPreChargePreDischargeCurAdaption(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GENCTRL.bit.IPCHGADT;
}

/** \brief Set Adaptive gate control
 * 
 *  \param e_value Adaptive gate control
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvAdaptGateCtrl(tBDRV_adaptGateCtrl e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_AGC_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_GENCTRL_AGC_Pos) & TLE9563_GENCTRL_AGC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Adaptive gate control
 * 
 *  \return uint16_t Adaptive gate control
 */
uint16_t TLE9563_getBdrvAdaptGateCtrl(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GENCTRL.bit.AGC;
}

/** \brief Enable CPEN
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCp(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_CPEN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_GENCTRL_CPEN_Pos) & TLE9563_GENCTRL_CPEN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable CPEN
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCp(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_CPEN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_GENCTRL_CPEN_Pos) & TLE9563_GENCTRL_CPEN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get CPEN Enable/Disable Setting
 * 
 *  \return  CPEN Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCp(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GENCTRL.bit.CPEN;
}

