jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Enable Postcharge disable bit
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvPostCharge(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_POCHGDIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_GENCTRL_POCHGDIS_Pos) & TLE9563_GENCTRL_POCHGDIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Postcharge disable bit
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvPostCharge(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_POCHGDIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_GENCTRL_POCHGDIS_Pos) & TLE9563_GENCTRL_POCHGDIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Postcharge disable bit Enable/Disable Setting
 * 
 *  \return  Postcharge disable bit Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getBdrvPostCharge(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GENCTRL.bit.POCHGDIS;
}

/** \brief Enable Filter for adaptive gate control
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvAdaptGateFilt(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_AGCFILT_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_GENCTRL_AGCFILT_Pos) & TLE9563_GENCTRL_AGCFILT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Filter for adaptive gate control
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvAdaptGateFilt(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_AGCFILT_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_GENCTRL_AGCFILT_Pos) & TLE9563_GENCTRL_AGCFILT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Filter for adaptive gate control Enable/Disable Setting
 * 
 *  \return  Filter for adaptive gate control Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvAdaptGateFilt(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GENCTRL.bit.AGCFILT;
}

/** \brief Enable Detection of active / FW MOSFET
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvDetectGeneratorMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_EN_GEN_CHECK_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_GENCTRL_EN_GEN_CHECK_Pos) & TLE9563_GENCTRL_EN_GEN_CHECK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Detection of active / FW MOSFET
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvDetectGeneratorMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_EN_GEN_CHECK_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_GENCTRL_EN_GEN_CHECK_Pos) & TLE9563_GENCTRL_EN_GEN_CHECK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Detection of active / FW MOSFET Enable/Disable Setting
 * 
 *  \return  Detection of active / FW MOSFET Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvDetectGeneratorMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GENCTRL.bit.EN_GEN_CHECK;
}

/** \brief Set Gate driver hold current IHOLD
 * 
 *  \param e_value Gate driver hold current IHOLD
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHoldCur(tBDRV_holdCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_IHOLD_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_GENCTRL_IHOLD_Pos) & TLE9563_GENCTRL_IHOLD_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Gate driver hold current IHOLD
 * 
 *  \return uint16_t Gate driver hold current IHOLD
 */
uint16_t TLE9563_getBdrvHoldCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GENCTRL.bit.IHOLD;
}

/** \brief Enable Frequency modulation of the charge pump
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCpFreqMod(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_FMODE_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_GENCTRL_FMODE_Pos) & TLE9563_GENCTRL_FMODE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

