jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Disable Frequency modulation of the charge pump
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCpFreqMod(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->GENCTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_GENCTRL_FMODE_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_GENCTRL_FMODE_Pos) & TLE9563_GENCTRL_FMODE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setGENCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Frequency modulation of the charge pump Enable/Disable Setting
 * 
 *  \return  Frequency modulation of the charge pump Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCpFreqMod(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GENCTRL.bit.FMODE;
}

/** \brief Get Current sense amplifier Register
 * 
 *  \return uint16_t Current sense amplifier Register
 */
uint16_t TLE9563_getCsaCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CSA.reg;
}

/** \brief Set Current sense amplifier Register
 * 
 *  \param u16_value Current sense amplifier Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCsaCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Selection of 3 or 6 PWM inputs
 * 
 *  \param e_value Selection of 3 or 6 PWM inputs
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvNumberOfPwmInputs(tBDRV_numberOfPwmInputs e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_PWM_NB_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CSA_PWM_NB_Pos) & TLE9563_CSA_PWM_NB_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Selection of 3 or 6 PWM inputs
 * 
 *  \return uint16_t Selection of 3 or 6 PWM inputs
 */
uint16_t TLE9563_getBdrvNumberOfPwmInputs(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CSA.bit.PWM_NB;
}

/** \brief Set Capacitance connected to the current sense amplifier output (CCSO), see also Chapter 12.12.4
 * 
 *  \param e_value Capacitance connected to the current sense amplifier output (CCSO), see also Chapter 12.12.4
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCsaCap(tCSA_cap e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_CSO_CAP_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CSA_CSO_CAP_Pos) & TLE9563_CSA_CSO_CAP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Capacitance connected to the current sense amplifier output (CCSO), see also Chapter 12.12.4
 * 
 *  \return uint16_t Capacitance connected to the current sense amplifier output (CCSO), see also Chapter 12.12.4
 */
uint16_t TLE9563_getCsaCap(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CSA.bit.CSO_CAP;
}

/** \brief Set Direction of the current sense amplifier
 * 
 *  \param e_value Direction of the current sense amplifier
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCsaDir(tCSA_dir e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_CSD_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CSA_CSD_Pos) & TLE9563_CSA_CSD_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Direction of the current sense amplifier
 * 
 *  \return uint16_t Direction of the current sense amplifier
 */
uint16_t TLE9563_getCsaDir(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CSA.bit.CSD;
}

/** \brief Set Overcurrent filter time of CSO
 * 
 *  \param e_value Overcurrent filter time of CSO
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCsaOverCurFiltTime(tCSA_overCurFiltTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_OCFILT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CSA_OCFILT_Pos) & TLE9563_CSA_OCFILT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

