jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get Overcurrent filter time of CSO
 * 
 *  \return uint16_t Overcurrent filter time of CSO
 */
uint16_t TLE9563_getCsaOverCurFiltTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CSA.bit.OCFILT;
}

/** \brief Enable CSA OFF
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCsa(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_CSA_OFF_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_CSA_CSA_OFF_Pos) & TLE9563_CSA_CSA_OFF_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable CSA OFF
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCsa(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_CSA_OFF_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_CSA_CSA_OFF_Pos) & TLE9563_CSA_CSA_OFF_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get CSA OFF Enable/Disable Setting
 * 
 *  \return  CSA OFF Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getCsa(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->CSA.bit.CSA_OFF;
}

/** \brief Set Overcurrent detection threshold of CSO
 * 
 *  \param e_value Overcurrent detection threshold of CSO
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCsaOverCurThresh(tCSA_overCurThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_OCTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CSA_OCTH_Pos) & TLE9563_CSA_OCTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Overcurrent detection threshold of CSO
 * 
 *  \return uint16_t Overcurrent detection threshold of CSO
 */
uint16_t TLE9563_getCsaOverCurThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CSA.bit.OCTH;
}

/** \brief Set Gain of the current sense amplifier
 * 
 *  \param e_value Gain of the current sense amplifier
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCsaGain(tCSA_gain e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_CSAG_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CSA_CSAG_Pos) & TLE9563_CSA_CSAG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Gain of the current sense amplifier
 * 
 *  \return uint16_t Gain of the current sense amplifier
 */
uint16_t TLE9563_getCsaGain(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CSA.bit.CSAG;
}

/** \brief Enable Overcurrent shutdown Enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCsaOverCurShutDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_OCEN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_CSA_OCEN_Pos) & TLE9563_CSA_OCEN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Overcurrent shutdown Enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCsaOverCurShutDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CSA.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CSA_OCEN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_CSA_OCEN_Pos) & TLE9563_CSA_OCEN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCSA;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Overcurrent shutdown Enable Enable/Disable Setting
 * 
 *  \return  Overcurrent shutdown Enable Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCsaOverCurShutDown(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->CSA.bit.OCEN;
}

/** \brief Get VDS monitoring threshold LS1-3 Register
 * 
 *  \return uint16_t VDS monitoring threshold LS1-3 Register
 */
uint16_t TLE9563_getVdsLsCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->LS_VDS.reg;
}

/** \brief Set VDS monitoring threshold LS1-3 Register
 * 
 *  \param u16_value VDS monitoring threshold LS1-3 Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsLsCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setLSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Filter time of drain-source voltage monitoring
 * 
 *  \param e_value Filter time of drain-source voltage monitoring
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsFiltTime(tVDS_filtTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->LS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_LS_VDS_TFVDS_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_LS_VDS_TFVDS_Pos) & TLE9563_LS_VDS_TFVDS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setLSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Filter time of drain-source voltage monitoring
 * 
 *  \return uint16_t Filter time of drain-source voltage monitoring
 */
uint16_t TLE9563_getVdsFiltTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->LS_VDS.bit.TFVDS;
}

/** \brief Set LS3 drain-source overvoltage threshold
 * 
 *  \param e_value LS3 drain-source overvoltage threshold
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsLs3OverVoltThresh(tVDS_lsOverVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->LS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_LS_VDS_LS3VDSTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_LS_VDS_LS3VDSTH_Pos) & TLE9563_LS_VDS_LS3VDSTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setLSVDS;
    u8_success = 1;
  }
  return u8_success;
}

