jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get LS3 drain-source overvoltage threshold
 * 
 *  \return uint16_t LS3 drain-source overvoltage threshold
 */
uint16_t TLE9563_getVdsLs3OverVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->LS_VDS.bit.LS3VDSTH;
}

/** \brief Set LS2 drain-source overvoltage threshold
 * 
 *  \param e_value LS2 drain-source overvoltage threshold
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsLs2OverVoltThresh(tVDS_lsOverVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->LS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_LS_VDS_LS2VDSTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_LS_VDS_LS2VDSTH_Pos) & TLE9563_LS_VDS_LS2VDSTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setLSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get LS2 drain-source overvoltage threshold
 * 
 *  \return uint16_t LS2 drain-source overvoltage threshold
 */
uint16_t TLE9563_getVdsLs2OverVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->LS_VDS.bit.LS2VDSTH;
}

/** \brief Set LS1 drain-source overvoltage threshold
 * 
 *  \param e_value LS1 drain-source overvoltage threshold
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsLs1OverVoltThresh(tVDS_lsOverVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->LS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_LS_VDS_LS1VDSTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_LS_VDS_LS1VDSTH_Pos) & TLE9563_LS_VDS_LS1VDSTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setLSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get LS1 drain-source overvoltage threshold
 * 
 *  \return uint16_t LS1 drain-source overvoltage threshold
 */
uint16_t TLE9563_getVdsLs1OverVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->LS_VDS.bit.LS1VDSTH;
}

/** \brief Get VDS monitoring threshold HS1-3 Register
 * 
 *  \return uint16_t VDS monitoring threshold HS1-3 Register
 */
uint16_t TLE9563_getVdsHsCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_VDS.reg;
}

/** \brief Set VDS monitoring threshold HS1-3 Register
 * 
 *  \param u16_value VDS monitoring threshold HS1-3 Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsHsCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Enable Deep adaptation enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvDeepAdapt(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_VDS_DEEP_ADAP_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HS_VDS_DEEP_ADAP_Pos) & TLE9563_HS_VDS_DEEP_ADAP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Deep adaptation enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvDeepAdapt(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_VDS_DEEP_ADAP_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HS_VDS_DEEP_ADAP_Pos) & TLE9563_HS_VDS_DEEP_ADAP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Deep adaptation enable Enable/Disable Setting
 * 
 *  \return  Deep adaptation enable Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvDeepAdapt(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_VDS.bit.DEEP_ADAP;
}

/** \brief Set HS3 drain-source overvoltage threshold
 * 
 *  \param e_value HS3 drain-source overvoltage threshold
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsHs3OverVoltThresh(tVDS_hsOverVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_VDS_HS3VDSTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HS_VDS_HS3VDSTH_Pos) & TLE9563_HS_VDS_HS3VDSTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get HS3 drain-source overvoltage threshold
 * 
 *  \return uint16_t HS3 drain-source overvoltage threshold
 */
uint16_t TLE9563_getVdsHs3OverVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_VDS.bit.HS3VDSTH;
}

/** \brief Set HS2 drain-source overvoltage threshold
 * 
 *  \param e_value HS2 drain-source overvoltage threshold
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsHs2OverVoltThresh(tVDS_hsOverVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_VDS_HS2VDSTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HS_VDS_HS2VDSTH_Pos) & TLE9563_HS_VDS_HS2VDSTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSVDS;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get HS2 drain-source overvoltage threshold
 * 
 *  \return uint16_t HS2 drain-source overvoltage threshold
 */
uint16_t TLE9563_getVdsHs2OverVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_VDS.bit.HS2VDSTH;
}

/** \brief Set HS1 drain-source overvoltage threshold
 * 
 *  \param e_value HS1 drain-source overvoltage threshold
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsHs1OverVoltThresh(tVDS_hsOverVoltThresh e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HS_VDS.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HS_VDS_HS1VDSTH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HS_VDS_HS1VDSTH_Pos) & TLE9563_HS_VDS_HS1VDSTH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHSVDS;
    u8_success = 1;
  }
  return u8_success;
}

