jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get HS1 drain-source overvoltage threshold
 * 
 *  \return uint16_t HS1 drain-source overvoltage threshold
 */
uint16_t TLE9563_getVdsHs1OverVoltThresh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_VDS.bit.HS1VDSTH;
}

/** \brief Get CCP and times selection Register
 * 
 *  \return uint16_t CCP and times selection Register
 */
uint16_t TLE9563_getCcpBlankHb1ActCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK0.reg;
}

/** \brief Set CCP and times selection Register
 * 
 *  \param u16_value CCP and times selection Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCcpBlankHb1ActCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Blank time
 * 
 *  \param e_value Blank time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1ActTblank(tBDRV_tBlank e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK0_TBLANK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK0_TBLANK_Pos) & TLE9563_CCP_BLK_BNK0_TBLANK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Blank time
 * 
 *  \return uint16_t Blank time
 */
uint16_t TLE9563_getBdrvHb1ActTblank(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK0.bit.TBLANK;
}

/** \brief Set Cross-current protection time
 * 
 *  \param e_value Cross-current protection time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1ActTccp(tBDRV_tCcp e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK0_TCCP_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK0_TCCP_Pos) & TLE9563_CCP_BLK_BNK0_TCCP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Cross-current protection time
 * 
 *  \return uint16_t Cross-current protection time
 */
uint16_t TLE9563_getBdrvHb1ActTccp(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK0.bit.TCCP;
}

/** \brief Get CCP and times selection Register
 * 
 *  \return uint16_t CCP and times selection Register
 */
uint16_t TLE9563_getCcpBlankHb2ActCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK1.reg;
}

/** \brief Set CCP and times selection Register
 * 
 *  \param u16_value CCP and times selection Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCcpBlankHb2ActCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Blank time
 * 
 *  \param e_value Blank time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2ActTblank(tBDRV_tBlank e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK1_TBLANK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK1_TBLANK_Pos) & TLE9563_CCP_BLK_BNK1_TBLANK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Blank time
 * 
 *  \return uint16_t Blank time
 */
uint16_t TLE9563_getBdrvHb2ActTblank(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK1.bit.TBLANK;
}

/** \brief Set Cross-current protection time
 * 
 *  \param e_value Cross-current protection time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2ActTccp(tBDRV_tCcp e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK1_TCCP_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK1_TCCP_Pos) & TLE9563_CCP_BLK_BNK1_TCCP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Cross-current protection time
 * 
 *  \return uint16_t Cross-current protection time
 */
uint16_t TLE9563_getBdrvHb2ActTccp(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK1.bit.TCCP;
}

/** \brief Get CCP and times selection Register
 * 
 *  \return uint16_t CCP and times selection Register
 */
uint16_t TLE9563_getCcpBlankHb3ActCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK2.reg;
}

/** \brief Set CCP and times selection Register
 * 
 *  \param u16_value CCP and times selection Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCcpBlankHb3ActCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK2;
    u8_success = 1;
  }
  return u8_success;
}

