jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set Blank time
 * 
 *  \param e_value Blank time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2FwTblank(tBDRV_tBlank e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK5.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK5_TBLANK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK5_TBLANK_Pos) & TLE9563_CCP_BLK_BNK5_TBLANK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK5;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Blank time
 * 
 *  \return uint16_t Blank time
 */
uint16_t TLE9563_getBdrvHb2FwTblank(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK5.bit.TBLANK;
}

/** \brief Set Cross-current protection time
 * 
 *  \param e_value Cross-current protection time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2FwTccp(tBDRV_tCcp e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK5.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK5_TCCP_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK5_TCCP_Pos) & TLE9563_CCP_BLK_BNK5_TCCP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK5;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Cross-current protection time
 * 
 *  \return uint16_t Cross-current protection time
 */
uint16_t TLE9563_getBdrvHb2FwTccp(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK5.bit.TCCP;
}

/** \brief Get CCP and times selection Register
 * 
 *  \return uint16_t CCP and times selection Register
 */
uint16_t TLE9563_getCcpBlankHb3FwCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK6.reg;
}

/** \brief Set CCP and times selection Register
 * 
 *  \param u16_value CCP and times selection Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCcpBlankHb3FwCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK6;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Blank time
 * 
 *  \param e_value Blank time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3FwTblank(tBDRV_tBlank e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK6.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK6_TBLANK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK6_TBLANK_Pos) & TLE9563_CCP_BLK_BNK6_TBLANK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK6;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Blank time
 * 
 *  \return uint16_t Blank time
 */
uint16_t TLE9563_getBdrvHb3FwTblank(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK6.bit.TBLANK;
}

/** \brief Set Cross-current protection time
 * 
 *  \param e_value Cross-current protection time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3FwTccp(tBDRV_tCcp e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->CCP_BLK_BNK6.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_CCP_BLK_BNK6_TCCP_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_CCP_BLK_BNK6_TCCP_Pos) & TLE9563_CCP_BLK_BNK6_TCCP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setCCPBLKBNK6;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Cross-current protection time
 * 
 *  \return uint16_t Cross-current protection time
 */
uint16_t TLE9563_getBdrvHb3FwTccp(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->CCP_BLK_BNK6.bit.TCCP;
}

/** \brief Get Half-Bridge MODE Register
 * 
 *  \return uint16_t Half-Bridge MODE Register
 */
uint16_t TLE9563_getHbModeCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HBMODE.reg;
}

/** \brief Set Half-Bridge MODE Register
 * 
 *  \param u16_value Half-Bridge MODE Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setHbModeCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Half-bridge 3 MODE selection
 * 
 *  \param e_value Half-bridge 3 MODE selection
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3Mode(tBDRV_hb3Mode e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB3MODE_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HBMODE_HB3MODE_Pos) & TLE9563_HBMODE_HB3MODE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

