jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get Half-bridge 3 MODE selection
 * 
 *  \return uint16_t Half-bridge 3 MODE selection
 */
uint16_t TLE9563_getBdrvHb3Mode(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HBMODE.bit.HB3MODE;
}

/** \brief Enable Active freewheeling for half-bridge 3 during PWM
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb3ActiveFreeWheeling(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_AFW3_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HBMODE_AFW3_Pos) & TLE9563_HBMODE_AFW3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Active freewheeling for half-bridge 3 during PWM
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb3ActiveFreeWheeling(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_AFW3_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HBMODE_AFW3_Pos) & TLE9563_HBMODE_AFW3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Active freewheeling for half-bridge 3 during PWM Enable/Disable Setting
 * 
 *  \return  Active freewheeling for half-bridge 3 during PWM Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb3ActiveFreeWheeling(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HBMODE.bit.AFW3;
}

/** \brief Enable PWM mode for half-bridge 3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb3PwmMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB3_PWM_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HBMODE_HB3_PWM_EN_Pos) & TLE9563_HBMODE_HB3_PWM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable PWM mode for half-bridge 3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb3PwmMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB3_PWM_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HBMODE_HB3_PWM_EN_Pos) & TLE9563_HBMODE_HB3_PWM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get PWM mode for half-bridge 3 Enable/Disable Setting
 * 
 *  \return  PWM mode for half-bridge 3 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb3PwmMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HBMODE.bit.HB3_PWM_EN;
}

/** \brief Set Half-bridge 2 MODE selection
 * 
 *  \param e_value Half-bridge 2 MODE selection
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2Mode(tBDRV_hb2Mode e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB2MODE_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HBMODE_HB2MODE_Pos) & TLE9563_HBMODE_HB2MODE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Half-bridge 2 MODE selection
 * 
 *  \return uint16_t Half-bridge 2 MODE selection
 */
uint16_t TLE9563_getBdrvHb2Mode(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HBMODE.bit.HB2MODE;
}

/** \brief Enable Active freewheeling for half-bridge 2 during PWM
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb2ActiveFreeWheeling(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_AFW2_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HBMODE_AFW2_Pos) & TLE9563_HBMODE_AFW2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Active freewheeling for half-bridge 2 during PWM
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb2ActiveFreeWheeling(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_AFW2_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HBMODE_AFW2_Pos) & TLE9563_HBMODE_AFW2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Active freewheeling for half-bridge 2 during PWM Enable/Disable Setting
 * 
 *  \return  Active freewheeling for half-bridge 2 during PWM Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb2ActiveFreeWheeling(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HBMODE.bit.AFW2;
}

/** \brief Enable PWM mode for half-bridge 2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb2PwmMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB2_PWM_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HBMODE_HB2_PWM_EN_Pos) & TLE9563_HBMODE_HB2_PWM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

