jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Disable PWM mode for half-bridge 2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb2PwmMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB2_PWM_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HBMODE_HB2_PWM_EN_Pos) & TLE9563_HBMODE_HB2_PWM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get PWM mode for half-bridge 2 Enable/Disable Setting
 * 
 *  \return  PWM mode for half-bridge 2 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb2PwmMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HBMODE.bit.HB2_PWM_EN;
}

/** \brief Set Half-bridge 1 MODE selection
 * 
 *  \param e_value Half-bridge 1 MODE selection
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1Mode(tBDRV_hb1Mode e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB1MODE_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HBMODE_HB1MODE_Pos) & TLE9563_HBMODE_HB1MODE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Half-bridge 1 MODE selection
 * 
 *  \return uint16_t Half-bridge 1 MODE selection
 */
uint16_t TLE9563_getBdrvHb1Mode(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HBMODE.bit.HB1MODE;
}

/** \brief Enable Active freewheeling for half-bridge 1 during PWM
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb1ActiveFreeWheeling(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_AFW1_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HBMODE_AFW1_Pos) & TLE9563_HBMODE_AFW1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Active freewheeling for half-bridge 1 during PWM
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb1ActiveFreeWheeling(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_AFW1_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HBMODE_AFW1_Pos) & TLE9563_HBMODE_AFW1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Active freewheeling for half-bridge 1 during PWM Enable/Disable Setting
 * 
 *  \return  Active freewheeling for half-bridge 1 during PWM Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb1ActiveFreeWheeling(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HBMODE.bit.AFW1;
}

/** \brief Enable PWM mode for half-bridge 1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb1PwmMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB1_PWM_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HBMODE_HB1_PWM_EN_Pos) & TLE9563_HBMODE_HB1_PWM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable PWM mode for half-bridge 1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb1PwmMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HBMODE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HBMODE_HB1_PWM_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HBMODE_HB1_PWM_EN_Pos) & TLE9563_HBMODE_HB1_PWM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBMODE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get PWM mode for half-bridge 1 Enable/Disable Setting
 * 
 *  \return  PWM mode for half-bridge 1 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb1PwmMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HBMODE.bit.HB1_PWM_EN;
}

/** \brief Get HB pre-charge and pre-discharge time Register
 * 
 *  \return uint16_t HB pre-charge and pre-discharge time Register
 */
uint16_t TLE9563_getTpreChgCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK0.reg;
}

/** \brief Set HB pre-charge and pre-discharge time Register
 * 
 *  \param u16_value HB pre-charge and pre-discharge time Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTpreChgCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 * 
 *  \param e_value If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3PreChargeTime(tBDRV_preChargeDischargeTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TPRECHG_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TPRECHG_BNK0_TPCHG3_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TPRECHG_BNK0_TPCHG3_Pos) & TLE9563_TPRECHG_BNK0_TPCHG3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 * 
 *  \return uint16_t If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 */
uint16_t TLE9563_getBdrvHb3PreChargeTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK0.bit.TPCHG3;
}

