jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 * 
 *  \param e_value If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2PreChargeTime(tBDRV_preChargeDischargeTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TPRECHG_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TPRECHG_BNK0_TPCHG2_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TPRECHG_BNK0_TPCHG2_Pos) & TLE9563_TPRECHG_BNK0_TPCHG2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 * 
 *  \return uint16_t If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 */
uint16_t TLE9563_getBdrvHb2PreChargeTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK0.bit.TPCHG2;
}

/** \brief Set If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 * 
 *  \param e_value If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1PreChargeTime(tBDRV_preChargeDischargeTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TPRECHG_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TPRECHG_BNK0_TPCHG1_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TPRECHG_BNK0_TPCHG1_Pos) & TLE9563_TPRECHG_BNK0_TPCHG1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 * 
 *  \return uint16_t If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 */
uint16_t TLE9563_getBdrvHb1PreChargeTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK0.bit.TPCHG1;
}

/** \brief Get HB pre-charge and pre-discharge time Register
 * 
 *  \return uint16_t HB pre-charge and pre-discharge time Register
 */
uint16_t TLE9563_getTpreDischgCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK1.reg;
}

/** \brief Set HB pre-charge and pre-discharge time Register
 * 
 *  \param u16_value HB pre-charge and pre-discharge time Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTpreDischgCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 * 
 *  \param e_value If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3PreDischargeTime(tBDRV_preChargeDischargeTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TPRECHG_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TPRECHG_BNK1_TPCHG3_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TPRECHG_BNK1_TPCHG3_Pos) & TLE9563_TPRECHG_BNK1_TPCHG3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 * 
 *  \return uint16_t If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3
 */
uint16_t TLE9563_getBdrvHb3PreDischargeTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK1.bit.TPCHG3;
}

/** \brief Set If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 * 
 *  \param e_value If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2PreDischargeTime(tBDRV_preChargeDischargeTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TPRECHG_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TPRECHG_BNK1_TPCHG2_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TPRECHG_BNK1_TPCHG2_Pos) & TLE9563_TPRECHG_BNK1_TPCHG2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK1;
    u8_success = 1;
  }
  return u8_success;
}

