jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 * 
 *  \return uint16_t If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2
 */
uint16_t TLE9563_getBdrvHb2PreDischargeTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK1.bit.TPCHG2;
}

/** \brief Set If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 * 
 *  \param e_value If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1PreDischargeTime(tBDRV_preChargeDischargeTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TPRECHG_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TPRECHG_BNK1_TPCHG1_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TPRECHG_BNK1_TPCHG1_Pos) & TLE9563_TPRECHG_BNK1_TPCHG1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTPRECHGBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 * 
 *  \return uint16_t If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1
 */
uint16_t TLE9563_getBdrvHb1PreDischargeTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TPRECHG_BNK1.bit.TPCHG1;
}

/** \brief Get Static charge/discharge current Register
 * 
 *  \return uint16_t Static charge/discharge current Register
 */
uint16_t TLE9563_getStIchgCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->ST_ICHG.reg;
}

/** \brief Set Static charge/discharge current Register
 * 
 *  \param u16_value Static charge/discharge current Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setStIchgCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSTICHG;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Static charge and discharge currents of HB3
 * 
 *  \param e_value Static charge and discharge currents of HB3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3StaticChargeDischargeCur(tBDRV_staticChargeDischargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->ST_ICHG.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_ST_ICHG_ICHGST3_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_ST_ICHG_ICHGST3_Pos) & TLE9563_ST_ICHG_ICHGST3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSTICHG;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Static charge and discharge currents of HB3
 * 
 *  \return uint16_t Static charge and discharge currents of HB3
 */
uint16_t TLE9563_getBdrvHb3StaticChargeDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->ST_ICHG.bit.ICHGST3;
}

/** \brief Set Static charge and discharge currents of HB2
 * 
 *  \param e_value Static charge and discharge currents of HB2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2StaticChargeDischargeCur(tBDRV_staticChargeDischargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->ST_ICHG.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_ST_ICHG_ICHGST2_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_ST_ICHG_ICHGST2_Pos) & TLE9563_ST_ICHG_ICHGST2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSTICHG;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Static charge and discharge currents of HB2
 * 
 *  \return uint16_t Static charge and discharge currents of HB2
 */
uint16_t TLE9563_getBdrvHb2StaticChargeDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->ST_ICHG.bit.ICHGST2;
}

/** \brief Set Static charge and discharge currents of HB1
 * 
 *  \param e_value Static charge and discharge currents of HB1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1StaticChargeDischargeCur(tBDRV_staticChargeDischargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->ST_ICHG.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_ST_ICHG_ICHGST1_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_ST_ICHG_ICHGST1_Pos) & TLE9563_ST_ICHG_ICHGST1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSTICHG;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Static charge and discharge currents of HB1
 * 
 *  \return uint16_t Static charge and discharge currents of HB1
 */
uint16_t TLE9563_getBdrvHb1StaticChargeDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->ST_ICHG.bit.ICHGST1;
}

/** \brief Get HB charge/discharge currents for PWM operation Register
 * 
 *  \return uint16_t HB charge/discharge currents for PWM operation Register
 */
uint16_t TLE9563_getIchgHb1ActCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK0.reg;
}

/** \brief Set HB charge/discharge currents for PWM operation Register
 * 
 *  \param u16_value HB charge/discharge currents for PWM operation Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setIchgHb1ActCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set If ICHG_BNK =0xxB Discharge current of HBx active MOSFET
 * 
 *  \param e_value If ICHG_BNK =0xxB Discharge current of HBx active MOSFET
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1ActDischargeCur(tBDRV_dischargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_BNK0_IDCHG_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_BNK0_IDCHG_Pos) & TLE9563_HB_ICHG_BNK0_IDCHG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK0;
    u8_success = 1;
  }
  return u8_success;
}

