jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get If ICHG_BNK =0xxB Discharge current of HBx active MOSFET
 * 
 *  \return uint16_t If ICHG_BNK =0xxB Discharge current of HBx active MOSFET
 */
uint16_t TLE9563_getBdrvHb3ActDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK2.bit.IDCHG;
}

/** \brief Set If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \param e_value If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3ActChargeCur(tBDRV_chargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_BNK2.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_BNK2_ICHG_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_BNK2_ICHG_Pos) & TLE9563_HB_ICHG_BNK2_ICHG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint16_t If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 */
uint16_t TLE9563_getBdrvHb3ActChargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK2.bit.ICHG;
}

/** \brief Get HB charge/discharge currents for PWM operation Register
 * 
 *  \return uint16_t HB charge/discharge currents for PWM operation Register
 */
uint16_t TLE9563_getIchgHb1FwCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK4.reg;
}

/** \brief Set HB charge/discharge currents for PWM operation Register
 * 
 *  \param u16_value HB charge/discharge currents for PWM operation Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setIchgHb1FwCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK4;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \param e_value If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1FwChargeAndDischargeCur(tBDRV_chargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_BNK4.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_BNK4_ICHG_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_BNK4_ICHG_Pos) & TLE9563_HB_ICHG_BNK4_ICHG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK4;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint16_t If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 */
uint16_t TLE9563_getBdrvHb1FwChargeAndDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK4.bit.ICHG;
}

/** \brief Get HB charge/discharge currents for PWM operation Register
 * 
 *  \return uint16_t HB charge/discharge currents for PWM operation Register
 */
uint16_t TLE9563_getIchgHb2FwCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK5.reg;
}

/** \brief Set HB charge/discharge currents for PWM operation Register
 * 
 *  \param u16_value HB charge/discharge currents for PWM operation Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setIchgHb2FwCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK5;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \param e_value If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2FwChargeAndDischargeCur(tBDRV_chargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_BNK5.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_BNK5_ICHG_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_BNK5_ICHG_Pos) & TLE9563_HB_ICHG_BNK5_ICHG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK5;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint16_t If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 */
uint16_t TLE9563_getBdrvHb2FwChargeAndDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK5.bit.ICHG;
}

/** \brief Get HB charge/discharge currents for PWM operation Register
 * 
 *  \return uint16_t HB charge/discharge currents for PWM operation Register
 */
uint16_t TLE9563_getIchgHb3FwCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK6.reg;
}

/** \brief Set HB charge/discharge currents for PWM operation Register
 * 
 *  \param u16_value HB charge/discharge currents for PWM operation Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setIchgHb3FwCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK6;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \param e_value If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3FwChargeAndDischargeCur(tBDRV_chargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_BNK6.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_BNK6_ICHG_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_BNK6_ICHG_Pos) & TLE9563_HB_ICHG_BNK6_ICHG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGBNK6;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 * 
 *  \return uint16_t If ICHG_BNK=0xxB Charge current of HBx active MOSFET
 */
uint16_t TLE9563_getBdrvHb3FwChargeAndDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_BNK6.bit.ICHG;
}

