jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get HB max. pre-charge/pre-discharge in PWM operation current and diagnostic pull-down Register
 * 
 *  \return uint16_t HB max. pre-charge/pre-discharge in PWM operation current and diagnostic pull-down Register
 */
uint16_t TLE9563_getIchgMaxCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_MAX.reg;
}

/** \brief Set HB max. pre-charge/pre-discharge in PWM operation current and diagnostic pull-down Register
 * 
 *  \param u16_value HB max. pre-charge/pre-discharge in PWM operation current and diagnostic pull-down Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setIchgMaxCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Enable Control of HB3 off-state current source and current sink
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb3DiagPullDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_HB3IDIAG_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HB_ICHG_MAX_HB3IDIAG_Pos) & TLE9563_HB_ICHG_MAX_HB3IDIAG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Control of HB3 off-state current source and current sink
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb3DiagPullDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_HB3IDIAG_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HB_ICHG_MAX_HB3IDIAG_Pos) & TLE9563_HB_ICHG_MAX_HB3IDIAG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Control of HB3 off-state current source and current sink Enable/Disable Setting
 * 
 *  \return  Control of HB3 off-state current source and current sink Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb3DiagPullDown(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HB_ICHG_MAX.bit.HB3IDIAG;
}

/** \brief Enable Control of HB2 pull-down for off-state diagnostic
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb2DiagPullDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_HB2IDIAG_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HB_ICHG_MAX_HB2IDIAG_Pos) & TLE9563_HB_ICHG_MAX_HB2IDIAG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Control of HB2 pull-down for off-state diagnostic
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb2DiagPullDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_HB2IDIAG_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HB_ICHG_MAX_HB2IDIAG_Pos) & TLE9563_HB_ICHG_MAX_HB2IDIAG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Control of HB2 pull-down for off-state diagnostic Enable/Disable Setting
 * 
 *  \return  Control of HB2 pull-down for off-state diagnostic Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb2DiagPullDown(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HB_ICHG_MAX.bit.HB2IDIAG;
}

/** \brief Enable Control of HB1 pull-down for off-state diagnostic
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enBdrvHb1DiagPullDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_HB1IDIAG_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_HB_ICHG_MAX_HB1IDIAG_Pos) & TLE9563_HB_ICHG_MAX_HB1IDIAG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

