jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Disable Control of HB1 pull-down for off-state diagnostic
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disBdrvHb1DiagPullDown(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_HB1IDIAG_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_HB_ICHG_MAX_HB1IDIAG_Pos) & TLE9563_HB_ICHG_MAX_HB1IDIAG_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Control of HB1 pull-down for off-state diagnostic Enable/Disable Setting
 * 
 *  \return  Control of HB1 pull-down for off-state diagnostic Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getBdrvHb1DiagPullDown(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HB_ICHG_MAX.bit.HB1IDIAG;
}

/** \brief Set Maximum drive current of HB3 during the pre-charge and pre-discharge phases1)
 * 
 *  \param e_value Maximum drive current of HB3 during the pre-charge and pre-discharge phases1)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3MaxChargeCur(tBDRV_maxChargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_ICHGMAX3_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_MAX_ICHGMAX3_Pos) & TLE9563_HB_ICHG_MAX_ICHGMAX3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Maximum drive current of HB3 during the pre-charge and pre-discharge phases1)
 * 
 *  \return uint16_t Maximum drive current of HB3 during the pre-charge and pre-discharge phases1)
 */
uint16_t TLE9563_getBdrvHb3MaxChargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_MAX.bit.ICHGMAX3;
}

/** \brief Set Maximum drive current of HB2 during the pre-charge phase and pre-discharge phases1)
 * 
 *  \param e_value Maximum drive current of HB2 during the pre-charge phase and pre-discharge phases1)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2MaxChargeCur(tBDRV_maxChargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_ICHGMAX2_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_MAX_ICHGMAX2_Pos) & TLE9563_HB_ICHG_MAX_ICHGMAX2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Maximum drive current of HB2 during the pre-charge phase and pre-discharge phases1)
 * 
 *  \return uint16_t Maximum drive current of HB2 during the pre-charge phase and pre-discharge phases1)
 */
uint16_t TLE9563_getBdrvHb2MaxChargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_MAX.bit.ICHGMAX2;
}

/** \brief Set Maximum drive current of HB1 during the pre-charge and pre-discharge phases1)
 * 
 *  \param e_value Maximum drive current of HB1 during the pre-charge and pre-discharge phases1)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1MaxChargeCur(tBDRV_maxChargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_ICHG_MAX.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_ICHG_MAX_ICHGMAX1_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_ICHG_MAX_ICHGMAX1_Pos) & TLE9563_HB_ICHG_MAX_ICHGMAX1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBICHGMAX;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Maximum drive current of HB1 during the pre-charge and pre-discharge phases1)
 * 
 *  \return uint16_t Maximum drive current of HB1 during the pre-charge and pre-discharge phases1)
 */
uint16_t TLE9563_getBdrvHb1MaxChargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_ICHG_MAX.bit.ICHGMAX1;
}

/** \brief Get HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 * 
 *  \return uint16_t HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 */
uint16_t TLE9563_getPreChgInitHb1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK0.reg;
}

/** \brief Set HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 * 
 *  \param u16_value HBx pre-charge/pre-discharge initialization configuration in PWM operation Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPreChgInitHb1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \param e_value Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1InitPreDischargeCur(tBDRV_dischargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_PCHG_INIT_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_PCHG_INIT_BNK0_PDCHGINIT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_PCHG_INIT_BNK0_PDCHGINIT_Pos) & TLE9563_HB_PCHG_INIT_BNK0_PDCHGINIT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \return uint16_t Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 */
uint16_t TLE9563_getBdrvHb1InitPreDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK0.bit.PDCHGINIT;
}

