jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \param e_value Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1InitPreChargeCur(tBDRV_chargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_PCHG_INIT_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_PCHG_INIT_BNK0_PCHGINIT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_PCHG_INIT_BNK0_PCHGINIT_Pos) & TLE9563_HB_PCHG_INIT_BNK0_PCHGINIT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \return uint16_t Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 */
uint16_t TLE9563_getBdrvHb1InitPreChargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK0.bit.PCHGINIT;
}

/** \brief Get HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 * 
 *  \return uint16_t HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 */
uint16_t TLE9563_getPreChgInitHb2CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK1.reg;
}

/** \brief Set HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 * 
 *  \param u16_value HBx pre-charge/pre-discharge initialization configuration in PWM operation Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPreChgInitHb2CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \param e_value Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2InitPreDischargeCur(tBDRV_dischargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_PCHG_INIT_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_PCHG_INIT_BNK1_PDCHGINIT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_PCHG_INIT_BNK1_PDCHGINIT_Pos) & TLE9563_HB_PCHG_INIT_BNK1_PDCHGINIT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \return uint16_t Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 */
uint16_t TLE9563_getBdrvHb2InitPreDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK1.bit.PDCHGINIT;
}

/** \brief Set Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \param e_value Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2InitPreChargeCur(tBDRV_chargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_PCHG_INIT_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_PCHG_INIT_BNK1_PCHGINIT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_PCHG_INIT_BNK1_PCHGINIT_Pos) & TLE9563_HB_PCHG_INIT_BNK1_PCHGINIT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \return uint16_t Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 */
uint16_t TLE9563_getBdrvHb2InitPreChargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK1.bit.PCHGINIT;
}

/** \brief Get HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 * 
 *  \return uint16_t HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 */
uint16_t TLE9563_getPreChgInitHb3CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK2.reg;
}

