jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set HBx pre-charge/pre-discharge initialization configuration in PWM operation Register
 * 
 *  \param u16_value HBx pre-charge/pre-discharge initialization configuration in PWM operation Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setPreChgInitHb3CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \param e_value Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3InitPreDischargeCur(tBDRV_dischargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_PCHG_INIT_BNK2.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_PCHG_INIT_BNK2_PDCHGINIT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_PCHG_INIT_BNK2_PDCHGINIT_Pos) & TLE9563_HB_PCHG_INIT_BNK2_PDCHGINIT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 * 
 *  \return uint16_t Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B
 */
uint16_t TLE9563_getBdrvHb3InitPreDischargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK2.bit.PDCHGINIT;
}

/** \brief Set Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \param e_value Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3InitPreChargeCur(tBDRV_chargeCur e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->HB_PCHG_INIT_BNK2.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_HB_PCHG_INIT_BNK2_PCHGINIT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_HB_PCHG_INIT_BNK2_PCHGINIT_Pos) & TLE9563_HB_PCHG_INIT_BNK2_PCHGINIT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setHBPCHGINITBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 * 
 *  \return uint16_t Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34
 */
uint16_t TLE9563_getBdrvHb3InitPreChargeCur(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HB_PCHG_INIT_BNK2.bit.PCHGINIT;
}

/** \brief Get HBx inputs TDON configuration Register
 * 
 *  \return uint16_t HBx inputs TDON configuration Register
 */
uint16_t TLE9563_getTdonHb1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDON_HB_CTRL_BNK0.reg;
}

/** \brief Set HBx inputs TDON configuration Register
 * 
 *  \param u16_value HBx inputs TDON configuration Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTdonHb1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTDONHBCTRLBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Turn-on delay time of active MOSFET of HBx
 * 
 *  \param e_value Turn-on delay time of active MOSFET of HBx
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1Tdon(tBDRV_tdon e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TDON_HB_CTRL_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TDON_HB_CTRL_BNK0_TDON_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TDON_HB_CTRL_BNK0_TDON_Pos) & TLE9563_TDON_HB_CTRL_BNK0_TDON_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTDONHBCTRLBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Turn-on delay time of active MOSFET of HBx
 * 
 *  \return uint16_t Turn-on delay time of active MOSFET of HBx
 */
uint16_t TLE9563_getBdrvHb1Tdon(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDON_HB_CTRL_BNK0.bit.TDON;
}

/** \brief Get HBx inputs TDON configuration Register
 * 
 *  \return uint16_t HBx inputs TDON configuration Register
 */
uint16_t TLE9563_getTdonHb2CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDON_HB_CTRL_BNK1.reg;
}

/** \brief Set HBx inputs TDON configuration Register
 * 
 *  \param u16_value HBx inputs TDON configuration Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTdonHb2CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTDONHBCTRLBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Turn-on delay time of active MOSFET of HBx
 * 
 *  \param e_value Turn-on delay time of active MOSFET of HBx
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2Tdon(tBDRV_tdon e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TDON_HB_CTRL_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TDON_HB_CTRL_BNK1_TDON_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TDON_HB_CTRL_BNK1_TDON_Pos) & TLE9563_TDON_HB_CTRL_BNK1_TDON_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTDONHBCTRLBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Turn-on delay time of active MOSFET of HBx
 * 
 *  \return uint16_t Turn-on delay time of active MOSFET of HBx
 */
uint16_t TLE9563_getBdrvHb2Tdon(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDON_HB_CTRL_BNK1.bit.TDON;
}

/** \brief Get HBx inputs TDON configuration Register
 * 
 *  \return uint16_t HBx inputs TDON configuration Register
 */
uint16_t TLE9563_getTdonHb3CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDON_HB_CTRL_BNK2.reg;
}

/** \brief Set HBx inputs TDON configuration Register
 * 
 *  \param u16_value HBx inputs TDON configuration Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTdonHb3CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTDONHBCTRLBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Turn-on delay time of active MOSFET of HBx
 * 
 *  \param e_value Turn-on delay time of active MOSFET of HBx
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3Tdon(tBDRV_tdon e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TDON_HB_CTRL_BNK2.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TDON_HB_CTRL_BNK2_TDON_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TDON_HB_CTRL_BNK2_TDON_Pos) & TLE9563_TDON_HB_CTRL_BNK2_TDON_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTDONHBCTRLBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Turn-on delay time of active MOSFET of HBx
 * 
 *  \return uint16_t Turn-on delay time of active MOSFET of HBx
 */
uint16_t TLE9563_getBdrvHb3Tdon(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDON_HB_CTRL_BNK2.bit.TDON;
}

/** \brief Get HBx TDOFF configuration Register
 * 
 *  \return uint16_t HBx TDOFF configuration Register
 */
uint16_t TLE9563_getTdoffHb1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK0.reg;
}

/** \brief Set HBx TDOFF configuration Register
 * 
 *  \param u16_value HBx TDOFF configuration Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTdoffHb1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTDOFFHBCTRLBNK0;
    u8_success = 1;
  }
  return u8_success;
}

