jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \param e_value Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb1Tdoff(tBDRV_tdoff e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK0.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TDOFF_HB_CTRL_BNK0_TDOFF_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TDOFF_HB_CTRL_BNK0_TDOFF_Pos) & TLE9563_TDOFF_HB_CTRL_BNK0_TDOFF_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTDOFFHBCTRLBNK0;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \return uint16_t Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 */
uint16_t TLE9563_getBdrvHb1Tdoff(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK0.bit.TDOFF;
}

/** \brief Get HBx TDOFF configuration Register
 * 
 *  \return uint16_t HBx TDOFF configuration Register
 */
uint16_t TLE9563_getTdoffHb2CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK1.reg;
}

/** \brief Set HBx TDOFF configuration Register
 * 
 *  \param u16_value HBx TDOFF configuration Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTdoffHb2CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTDOFFHBCTRLBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \param e_value Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb2Tdoff(tBDRV_tdoff e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK1.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TDOFF_HB_CTRL_BNK1_TDOFF_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TDOFF_HB_CTRL_BNK1_TDOFF_Pos) & TLE9563_TDOFF_HB_CTRL_BNK1_TDOFF_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTDOFFHBCTRLBNK1;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \return uint16_t Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 */
uint16_t TLE9563_getBdrvHb2Tdoff(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK1.bit.TDOFF;
}

/** \brief Get HBx TDOFF configuration Register
 * 
 *  \return uint16_t HBx TDOFF configuration Register
 */
uint16_t TLE9563_getTdoffHb3CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK2.reg;
}

/** \brief Set HBx TDOFF configuration Register
 * 
 *  \param u16_value HBx TDOFF configuration Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setTdoffHb3CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setTDOFFHBCTRLBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \param e_value Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBdrvHb3Tdoff(tBDRV_tdoff e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK2.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_TDOFF_HB_CTRL_BNK2_TDOFF_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_TDOFF_HB_CTRL_BNK2_TDOFF_Pos) & TLE9563_TDOFF_HB_CTRL_BNK2_TDOFF_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setTDOFFHBCTRLBNK2;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 * 
 *  \return uint16_t Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D
 */
uint16_t TLE9563_getBdrvHb3Tdoff(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDOFF_HB_CTRL_BNK2.bit.TDOFF;
}

/** \brief Get Brake control Register
 * 
 *  \return uint16_t Brake control Register
 */
uint16_t TLE9563_getBrakeCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->BRAKE.reg;
}

/** \brief Set Brake control Register
 * 
 *  \param u16_value Brake control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setBrakeCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

