jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Enable LS3 output disable during SLAM mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enLs3CtrlInSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_LS3_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_BRAKE_SLAM_LS3_DIS_Pos) & TLE9563_BRAKE_SLAM_LS3_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable LS3 output disable during SLAM mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disLs3CtrlInSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_LS3_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_BRAKE_SLAM_LS3_DIS_Pos) & TLE9563_BRAKE_SLAM_LS3_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get LS3 output disable during SLAM mode Enable/Disable Setting
 * 
 *  \return  LS3 output disable during SLAM mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getLs3CtrlInSlamMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BRAKE.bit.SLAM_LS3_DIS;
}

/** \brief Enable LS2 output disable during SLAM mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enLs2CtrlInSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_LS2_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_BRAKE_SLAM_LS2_DIS_Pos) & TLE9563_BRAKE_SLAM_LS2_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable LS2 output disable during SLAM mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disLs2CtrlInSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_LS2_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_BRAKE_SLAM_LS2_DIS_Pos) & TLE9563_BRAKE_SLAM_LS2_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get LS2 output disable during SLAM mode Enable/Disable Setting
 * 
 *  \return  LS2 output disable during SLAM mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getLs2CtrlInSlamMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BRAKE.bit.SLAM_LS2_DIS;
}

/** \brief Enable LS1 output disable during SLAM mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enLs1CtrlInSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_LS1_DIS_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_BRAKE_SLAM_LS1_DIS_Pos) & TLE9563_BRAKE_SLAM_LS1_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable LS1 output disable during SLAM mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disLs1CtrlInSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_LS1_DIS_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_BRAKE_SLAM_LS1_DIS_Pos) & TLE9563_BRAKE_SLAM_LS1_DIS_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get LS1 output disable during SLAM mode Enable/Disable Setting
 * 
 *  \return  LS1 output disable during SLAM mode Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getLs1CtrlInSlamMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BRAKE.bit.SLAM_LS1_DIS;
}

/** \brief Enable Slam mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_BRAKE_SLAM_Pos) & TLE9563_BRAKE_SLAM_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

