jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Disable Slam mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSlamMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_SLAM_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_BRAKE_SLAM_Pos) & TLE9563_BRAKE_SLAM_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Slam mode Enable/Disable Setting
 * 
 *  \return  Slam mode Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSlamMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BRAKE.bit.SLAM;
}

/** \brief Set VDS Overvoltage for LS1-3 during braking
 * 
 *  \param e_value VDS Overvoltage for LS1-3 during braking
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsOverVoltThreshLsBrake(tVDS_overVoltThreshLsBrake e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_VDSTH_BRK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_BRAKE_VDSTH_BRK_Pos) & TLE9563_BRAKE_VDSTH_BRK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get VDS Overvoltage for LS1-3 during braking
 * 
 *  \return uint16_t VDS Overvoltage for LS1-3 during braking
 */
uint16_t TLE9563_getVdsOverVoltThreshLsBrake(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->BRAKE.bit.VDSTH_BRK;
}

/** \brief Set Blank time of VDS overvoltage during braking
 * 
 *  \param e_value Blank time of VDS overvoltage during braking
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVdsOverVoltBlankTimeBrake(tVDS_overVoltBlankTimeBrake e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_TBLK_BRK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_BRAKE_TBLK_BRK_Pos) & TLE9563_BRAKE_TBLK_BRK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Blank time of VDS overvoltage during braking
 * 
 *  \return uint16_t Blank time of VDS overvoltage during braking
 */
uint16_t TLE9563_getVdsOverVoltBlankTimeBrake(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->BRAKE.bit.TBLK_BRK;
}

/** \brief Enable Parking brake enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enParkingBrake(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_PARK_BRK_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_BRAKE_PARK_BRK_EN_Pos) & TLE9563_BRAKE_PARK_BRK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Parking brake enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disParkingBrake(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_PARK_BRK_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_BRAKE_PARK_BRK_EN_Pos) & TLE9563_BRAKE_PARK_BRK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Parking brake enable Enable/Disable Setting
 * 
 *  \return  Parking brake enable Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getParkingBrake(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BRAKE.bit.PARK_BRK_EN;
}

/** \brief Enable Overvoltage brake enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enOverVoltBrake(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_OV_BRK_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_BRAKE_OV_BRK_EN_Pos) & TLE9563_BRAKE_OV_BRK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Overvoltage brake enable
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disOverVoltBrake(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_OV_BRK_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_BRAKE_OV_BRK_EN_Pos) & TLE9563_BRAKE_OV_BRK_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Overvoltage brake enable Enable/Disable Setting
 * 
 *  \return  Overvoltage brake enable Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getOverVoltBrake(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BRAKE.bit.OV_BRK_EN;
}

/** \brief Set Overvoltage brake threshold
 * 
 *  \param e_value Overvoltage brake threshold
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setVsOverVoltThreshBrake(tVS_overVoltThreshBrake e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->BRAKE.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_BRAKE_OV_BRK_TH_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_BRAKE_OV_BRK_TH_Pos) & TLE9563_BRAKE_OV_BRK_TH_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setBRAKE;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Overvoltage brake threshold
 * 
 *  \return uint16_t Overvoltage brake threshold
 */
uint16_t TLE9563_getVsOverVoltThreshBrake(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->BRAKE.bit.OV_BRK_TH;
}

