jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get CAN Selective Wake Control Register
 * 
 *  \return uint16_t CAN Selective Wake Control Register
 */
uint16_t TLE9563_getCanSwkCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CTRL.reg;
}

/** \brief Set CAN Selective Wake Control Register
 * 
 *  \param u16_value CAN Selective Wake Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCanSwkCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Enable Oscillator Calibration Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCanSwkOscCalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_OSC_CAL_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_CTRL_OSC_CAL_Pos) & TLE9563_SWK_CTRL_OSC_CAL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Oscillator Calibration Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCanSwkOscCalMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_OSC_CAL_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_CTRL_OSC_CAL_Pos) & TLE9563_SWK_CTRL_OSC_CAL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Oscillator Calibration Mode Enable/Disable Setting
 * 
 *  \return  Oscillator Calibration Mode Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCanSwkOscCalMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CTRL.bit.OSC_CAL;
}

/** \brief Enable (Un)locking mechanism of oscillator recalibration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCanSwkOscRecalLock(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_TRIM_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_CTRL_TRIM_EN_Pos) & TLE9563_SWK_CTRL_TRIM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable (Un)locking mechanism of oscillator recalibration
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCanSwkOscRecalLock(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_TRIM_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_CTRL_TRIM_EN_Pos) & TLE9563_SWK_CTRL_TRIM_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get (Un)locking mechanism of oscillator recalibration Enable/Disable Setting
 * 
 *  \return  (Un)locking mechanism of oscillator recalibration Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCanSwkOscRecalLock(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CTRL.bit.TRIM_EN;
}

/** \brief Enable CAN Time Out Masking
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCanSwkTimeOutMask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_CANTO_MASK_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_CTRL_CANTO_MASK_Pos) & TLE9563_SWK_CTRL_CANTO_MASK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable CAN Time Out Masking
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCanSwkTimeOutMask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_CANTO_MASK_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_CTRL_CANTO_MASK_Pos) & TLE9563_SWK_CTRL_CANTO_MASK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

