jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief get CAN Time Out Masking Enable/Disable Setting
 * 
 *  \return  CAN Time Out Masking Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getCanSwkTimeOutMask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CTRL.bit.CANTO_MASK;
}

/** \brief Enable SWK Configuration valid
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCanSwkConfigValid(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_CFG_VAL_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_CTRL_CFG_VAL_Pos) & TLE9563_SWK_CTRL_CFG_VAL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable SWK Configuration valid
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCanSwkConfigValid(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CTRL_CFG_VAL_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_CTRL_CFG_VAL_Pos) & TLE9563_SWK_CTRL_CFG_VAL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get SWK Configuration valid Enable/Disable Setting
 * 
 *  \return  SWK Configuration valid Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCanSwkConfigValid(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CTRL.bit.CFG_VAL;
}

/** \brief Get SWK Bit Timing Control Register
 * 
 *  \return uint16_t SWK Bit Timing Control Register
 */
uint16_t TLE9563_getSwkBtl1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_BTL1_CTRL.reg;
}

/** \brief Set SWK Bit Timing Control Register
 * 
 *  \param u16_value SWK Bit Timing Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkBtl1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKBTL1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Sampling Point Position
 * 
 *  \param u8_value Sampling Point Position
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkSamplingPointPos(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_BTL1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_BTL1_CTRL_SP_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_BTL1_CTRL_SP_Pos) & TLE9563_SWK_BTL1_CTRL_SP_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKBTL1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Sampling Point Position
 * 
 *  \return uint16_t Sampling Point Position
 */
uint16_t TLE9563_getSwkSamplingPointPos(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_BTL1_CTRL.bit.SP;
}

/** \brief Set Number of Time Quanta in a Bit Time
 * 
 *  \param u8_value Number of Time Quanta in a Bit Time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkNbTimeQuanta(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_BTL1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_BTL1_CTRL_TBIT_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_BTL1_CTRL_TBIT_Pos) & TLE9563_SWK_BTL1_CTRL_TBIT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKBTL1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Number of Time Quanta in a Bit Time
 * 
 *  \return uint16_t Number of Time Quanta in a Bit Time
 */
uint16_t TLE9563_getSwkNbTimeQuanta(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_BTL1_CTRL.bit.TBIT;
}

/** \brief Get SWK WUF Identifier bits 28...13 Register
 * 
 *  \return uint16_t SWK WUF Identifier bits 28...13 Register
 */
uint16_t TLE9563_getSwkId1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
}

/** \brief Set SWK WUF Identifier bits 28...13 Register
 * 
 *  \param u16_value SWK WUF Identifier bits 28...13 Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkId1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set WUF Identifier Bit 28
 * 
 *  \param u8_value WUF Identifier Bit 28
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit28(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID28_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID28_Pos) & TLE9563_SWK_ID1_CTRL_ID28_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 28
 * 
 *  \return uint16_t WUF Identifier Bit 28
 */
uint16_t TLE9563_getSwkIdBit28(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID28;
}

/** \brief Set WUF Identifier Bit 27
 * 
 *  \param u8_value WUF Identifier Bit 27
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit27(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID27_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID27_Pos) & TLE9563_SWK_ID1_CTRL_ID27_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 27
 * 
 *  \return uint16_t WUF Identifier Bit 27
 */
uint16_t TLE9563_getSwkIdBit27(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID27;
}

/** \brief Set WUF Identifier Bit 26
 * 
 *  \param u8_value WUF Identifier Bit 26
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit26(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID26_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID26_Pos) & TLE9563_SWK_ID1_CTRL_ID26_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

