jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get WUF Identifier Bit 26
 * 
 *  \return uint16_t WUF Identifier Bit 26
 */
uint16_t TLE9563_getSwkIdBit26(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID26;
}

/** \brief Set WUF Identifier Bit 25
 * 
 *  \param u8_value WUF Identifier Bit 25
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit25(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID25_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID25_Pos) & TLE9563_SWK_ID1_CTRL_ID25_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 25
 * 
 *  \return uint16_t WUF Identifier Bit 25
 */
uint16_t TLE9563_getSwkIdBit25(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID25;
}

/** \brief Set WUF Identifier Bit 24
 * 
 *  \param u8_value WUF Identifier Bit 24
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit24(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID24_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID24_Pos) & TLE9563_SWK_ID1_CTRL_ID24_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 24
 * 
 *  \return uint16_t WUF Identifier Bit 24
 */
uint16_t TLE9563_getSwkIdBit24(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID24;
}

/** \brief Set WUF Identifier Bit 23
 * 
 *  \param u8_value WUF Identifier Bit 23
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit23(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID23_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID23_Pos) & TLE9563_SWK_ID1_CTRL_ID23_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 23
 * 
 *  \return uint16_t WUF Identifier Bit 23
 */
uint16_t TLE9563_getSwkIdBit23(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID23;
}

/** \brief Set WUF Identifier Bit 22
 * 
 *  \param u8_value WUF Identifier Bit 22
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit22(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID22_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID22_Pos) & TLE9563_SWK_ID1_CTRL_ID22_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 22
 * 
 *  \return uint16_t WUF Identifier Bit 22
 */
uint16_t TLE9563_getSwkIdBit22(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID22;
}

/** \brief Set WUF Identifier Bit 21
 * 
 *  \param u8_value WUF Identifier Bit 21
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit21(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID21_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID21_Pos) & TLE9563_SWK_ID1_CTRL_ID21_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 21
 * 
 *  \return uint16_t WUF Identifier Bit 21
 */
uint16_t TLE9563_getSwkIdBit21(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID21;
}

/** \brief Set WUF Identifier Bit 20
 * 
 *  \param u8_value WUF Identifier Bit 20
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit20(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID20_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID20_Pos) & TLE9563_SWK_ID1_CTRL_ID20_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 20
 * 
 *  \return uint16_t WUF Identifier Bit 20
 */
uint16_t TLE9563_getSwkIdBit20(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID20;
}

/** \brief Set WUF Identifier Bit 19
 * 
 *  \param u8_value WUF Identifier Bit 19
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit19(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID19_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID19_Pos) & TLE9563_SWK_ID1_CTRL_ID19_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 19
 * 
 *  \return uint16_t WUF Identifier Bit 19
 */
uint16_t TLE9563_getSwkIdBit19(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID19;
}

/** \brief Set WUF Identifier Bit 18
 * 
 *  \param u8_value WUF Identifier Bit 18
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit18(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID18_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID18_Pos) & TLE9563_SWK_ID1_CTRL_ID18_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

