jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get WUF Identifier Bit 18
 * 
 *  \return uint16_t WUF Identifier Bit 18
 */
uint16_t TLE9563_getSwkIdBit18(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID18;
}

/** \brief Set WUF Identifier Bit 17
 * 
 *  \param u8_value WUF Identifier Bit 17
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit17(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID17_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID17_Pos) & TLE9563_SWK_ID1_CTRL_ID17_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 17
 * 
 *  \return uint16_t WUF Identifier Bit 17
 */
uint16_t TLE9563_getSwkIdBit17(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID17;
}

/** \brief Set WUF Identifier Bit 16
 * 
 *  \param u8_value WUF Identifier Bit 16
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit16(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID16_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID16_Pos) & TLE9563_SWK_ID1_CTRL_ID16_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 16
 * 
 *  \return uint16_t WUF Identifier Bit 16
 */
uint16_t TLE9563_getSwkIdBit16(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID16;
}

/** \brief Set WUF Identifier Bit 15
 * 
 *  \param u8_value WUF Identifier Bit 15
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit15(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID15_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID15_Pos) & TLE9563_SWK_ID1_CTRL_ID15_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 15
 * 
 *  \return uint16_t WUF Identifier Bit 15
 */
uint16_t TLE9563_getSwkIdBit15(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID15;
}

/** \brief Set WUF Identifier Bit 14
 * 
 *  \param u8_value WUF Identifier Bit 14
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit14(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID14_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID14_Pos) & TLE9563_SWK_ID1_CTRL_ID14_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 14
 * 
 *  \return uint16_t WUF Identifier Bit 14
 */
uint16_t TLE9563_getSwkIdBit14(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID14;
}

/** \brief Set WUF Identifier Bit 13
 * 
 *  \param u8_value WUF Identifier Bit 13
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit13(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID1_CTRL_ID13_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID1_CTRL_ID13_Pos) & TLE9563_SWK_ID1_CTRL_ID13_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 13
 * 
 *  \return uint16_t WUF Identifier Bit 13
 */
uint16_t TLE9563_getSwkIdBit13(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID1_CTRL.bit.ID13;
}

/** \brief Get SWK WUF Identifier bits 12...0 Register
 * 
 *  \return uint16_t SWK WUF Identifier bits 12...0 Register
 */
uint16_t TLE9563_getSwkId0CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
}

