jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set SWK WUF Identifier bits 12...0 Register
 * 
 *  \param u16_value SWK WUF Identifier bits 12...0 Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkId0CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set WUF Identifier Bit 12
 * 
 *  \param u8_value WUF Identifier Bit 12
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit12(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID12_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID12_Pos) & TLE9563_SWK_ID0_CTRL_ID12_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 12
 * 
 *  \return uint16_t WUF Identifier Bit 12
 */
uint16_t TLE9563_getSwkIdBit12(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID12;
}

/** \brief Set WUF Identifier Bit 11
 * 
 *  \param u8_value WUF Identifier Bit 11
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit11(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID11_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID11_Pos) & TLE9563_SWK_ID0_CTRL_ID11_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 11
 * 
 *  \return uint16_t WUF Identifier Bit 11
 */
uint16_t TLE9563_getSwkIdBit11(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID11;
}

/** \brief Set WUF Identifier Bit 10
 * 
 *  \param u8_value WUF Identifier Bit 10
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit10(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID10_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID10_Pos) & TLE9563_SWK_ID0_CTRL_ID10_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 10
 * 
 *  \return uint16_t WUF Identifier Bit 10
 */
uint16_t TLE9563_getSwkIdBit10(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID10;
}

/** \brief Set WUF Identifier Bit 9
 * 
 *  \param u8_value WUF Identifier Bit 9
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit9(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID9_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID9_Pos) & TLE9563_SWK_ID0_CTRL_ID9_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 9
 * 
 *  \return uint16_t WUF Identifier Bit 9
 */
uint16_t TLE9563_getSwkIdBit9(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID9;
}

/** \brief Set WUF Identifier Bit 8
 * 
 *  \param u8_value WUF Identifier Bit 8
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit8(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID8_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID8_Pos) & TLE9563_SWK_ID0_CTRL_ID8_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 8
 * 
 *  \return uint16_t WUF Identifier Bit 8
 */
uint16_t TLE9563_getSwkIdBit8(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID8;
}

