jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set WUF Identifier Bit 7
 * 
 *  \param u8_value WUF Identifier Bit 7
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit7(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID7_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID7_Pos) & TLE9563_SWK_ID0_CTRL_ID7_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 7
 * 
 *  \return uint16_t WUF Identifier Bit 7
 */
uint16_t TLE9563_getSwkIdBit7(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID7;
}

/** \brief Set WUF Identifier Bit 6
 * 
 *  \param u8_value WUF Identifier Bit 6
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit6(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID6_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID6_Pos) & TLE9563_SWK_ID0_CTRL_ID6_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 6
 * 
 *  \return uint16_t WUF Identifier Bit 6
 */
uint16_t TLE9563_getSwkIdBit6(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID6;
}

/** \brief Set WUF Identifier Bit 5
 * 
 *  \param u8_value WUF Identifier Bit 5
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit5(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID5_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID5_Pos) & TLE9563_SWK_ID0_CTRL_ID5_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 5
 * 
 *  \return uint16_t WUF Identifier Bit 5
 */
uint16_t TLE9563_getSwkIdBit5(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID5;
}

/** \brief Set WUF Identifier Bit 4
 * 
 *  \param u8_value WUF Identifier Bit 4
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit4(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID4_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID4_Pos) & TLE9563_SWK_ID0_CTRL_ID4_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 4
 * 
 *  \return uint16_t WUF Identifier Bit 4
 */
uint16_t TLE9563_getSwkIdBit4(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID4;
}

/** \brief Set WUF Identifier Bit 3
 * 
 *  \param u8_value WUF Identifier Bit 3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit3(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID3_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID3_Pos) & TLE9563_SWK_ID0_CTRL_ID3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 3
 * 
 *  \return uint16_t WUF Identifier Bit 3
 */
uint16_t TLE9563_getSwkIdBit3(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID3;
}

/** \brief Set WUF Identifier Bit 2
 * 
 *  \param u8_value WUF Identifier Bit 2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit2(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID2_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID2_Pos) & TLE9563_SWK_ID0_CTRL_ID2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 2
 * 
 *  \return uint16_t WUF Identifier Bit 2
 */
uint16_t TLE9563_getSwkIdBit2(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID2;
}

/** \brief Set WUF Identifier Bit 1
 * 
 *  \param u8_value WUF Identifier Bit 1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit1(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID1_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID1_Pos) & TLE9563_SWK_ID0_CTRL_ID1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 1
 * 
 *  \return uint16_t WUF Identifier Bit 1
 */
uint16_t TLE9563_getSwkIdBit1(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID1;
}

/** \brief Set WUF Identifier Bit 0
 * 
 *  \param u8_value WUF Identifier Bit 0
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdBit0(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_ID0_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_ID0_CTRL_ID0_Pos) & TLE9563_SWK_ID0_CTRL_ID0_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get WUF Identifier Bit 0
 * 
 *  \return uint16_t WUF Identifier Bit 0
 */
uint16_t TLE9563_getSwkIdBit0(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.ID0;
}

/** \brief Set Remote Transmission Request Field (acc. ISO11898-22016)
 * 
 *  \param e_value Remote Transmission Request Field (acc. ISO11898-22016)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkRemoteTransReq(tSWK_remoteTransReq e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_RTR_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SWK_ID0_CTRL_RTR_Pos) & TLE9563_SWK_ID0_CTRL_RTR_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Remote Transmission Request Field (acc. ISO11898-22016)
 * 
 *  \return uint16_t Remote Transmission Request Field (acc. ISO11898-22016)
 */
uint16_t TLE9563_getSwkRemoteTransReq(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.RTR;
}

/** \brief Set Identifier Extension Bit
 * 
 *  \param e_value Identifier Extension Bit
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkIdExtBit(tSWK_idExtBit e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_ID0_CTRL_IDE_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SWK_ID0_CTRL_IDE_Pos) & TLE9563_SWK_ID0_CTRL_IDE_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Identifier Extension Bit
 * 
 *  \return uint16_t Identifier Extension Bit
 */
uint16_t TLE9563_getSwkIdExtBit(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_ID0_CTRL.bit.IDE;
}

/** \brief Get SWK WUF Identifier Mask bits 28...13 Register
 * 
 *  \return uint16_t SWK WUF Identifier Mask bits 28...13 Register
 */
uint16_t TLE9563_getSwkMaskId1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
}

/** \brief Set SWK WUF Identifier Mask bits 28...13 Register
 * 
 *  \param u16_value SWK WUF Identifier Mask bits 28...13 Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkMaskId1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

