jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Enable WUF Identifier Mask Bit 28
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit28Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 28
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit28Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 28 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 28 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit28Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID28;
}

/** \brief Enable WUF Identifier Mask Bit 27
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit27Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 27
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit27Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 27 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 27 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit27Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID27;
}

/** \brief Enable WUF Identifier Mask Bit 26
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit26Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 26
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit26Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 26 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 26 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit26Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID26;
}

/** \brief Enable WUF Identifier Mask Bit 25
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit25Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 25
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit25Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 25 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 25 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit25Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID25;
}

/** \brief Enable WUF Identifier Mask Bit 24
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit24Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 24
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit24Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

