jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief get WUF Identifier Mask Bit 24 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 24 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit24Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID24;
}

/** \brief Enable WUF Identifier Mask Bit 23
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit23Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 23
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit23Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 23 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 23 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit23Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID23;
}

/** \brief Enable WUF Identifier Mask Bit 22
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit22Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 22
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit22Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 22 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 22 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit22Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID22;
}

/** \brief Enable WUF Identifier Mask Bit 21
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit21Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 21
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit21Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

