jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Disable WUF Identifier Mask Bit 17
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit17Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID17_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID17_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID17_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 17 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 17 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit17Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID17;
}

/** \brief Enable WUF Identifier Mask Bit 16
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit16Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 16
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit16Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 16 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 16 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit16Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID16;
}

/** \brief Enable WUF Identifier Mask Bit 15
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit15Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 15
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit15Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 15 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 15 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit15Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID15;
}

/** \brief Enable WUF Identifier Mask Bit 14
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit14Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 14
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit14Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 14 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 14 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit14Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID14;
}

/** \brief Enable WUF Identifier Mask Bit 13
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit13Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 13
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit13Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Pos) & TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

