jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief get WUF Identifier Mask Bit 13 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 13 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit13Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID1_CTRL.bit.MASK_ID13;
}

/** \brief Get SWK WUF Identifier Mask bits 12...0 Register
 * 
 *  \return uint16_t SWK WUF Identifier Mask bits 12...0 Register
 */
uint16_t TLE9563_getSwkMaskId0CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
}

/** \brief Set SWK WUF Identifier Mask bits 12...0 Register
 * 
 *  \param u16_value SWK WUF Identifier Mask bits 12...0 Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkMaskId0CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Enable WUF Identifier Mask Bit 12
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit12Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 12
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit12Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 12 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 12 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit12Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID12;
}

/** \brief Enable WUF Identifier Mask Bit 11
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit11Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 11
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit11Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 11 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 11 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit11Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID11;
}

/** \brief Enable WUF Identifier Mask Bit 10
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit10Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 10
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit10Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

