jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief get WUF Identifier Mask Bit 10 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 10 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit10Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID10;
}

/** \brief Enable WUF Identifier Mask Bit 9
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit9Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 9
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit9Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 9 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 9 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit9Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID9;
}

/** \brief Enable WUF Identifier Mask Bit 8
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit8Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 8
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit8Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 8 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 8 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit8Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID8;
}

/** \brief Enable WUF Identifier Mask Bit 7
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit7Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 7
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit7Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 7 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 7 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit7Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID7;
}

/** \brief Enable WUF Identifier Mask Bit 6
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit6Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 6
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit6Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 6 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 6 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit6Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID6;
}

/** \brief Enable WUF Identifier Mask Bit 5
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit5Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

