jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Disable WUF Identifier Mask Bit 5
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit5Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 5 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 5 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit5Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID5;
}

/** \brief Enable WUF Identifier Mask Bit 4
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit4Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 4
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit4Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 4 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 4 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit4Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID4;
}

/** \brief Enable WUF Identifier Mask Bit 3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit3Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 3
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit3Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 3 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 3 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit3Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID3;
}

/** \brief Enable WUF Identifier Mask Bit 2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit2Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 2
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit2Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 2 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 2 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit2Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID2;
}

/** \brief Enable WUF Identifier Mask Bit 1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit1Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 1
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit1Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 1 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 1 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit1Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID1;
}

