jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Enable WUF Identifier Mask Bit 0
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkIdBit0Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable WUF Identifier Mask Bit 0
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkIdBit0Mask(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_MASK_ID0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Pos) & TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKMASKID0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get WUF Identifier Mask Bit 0 Enable/Disable Setting
 * 
 *  \return  WUF Identifier Mask Bit 0 Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkIdBit0Mask(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_MASK_ID0_CTRL.bit.MASK_ID0;
}

/** \brief Get SWK Frame Data Length Code Control Register
 * 
 *  \return uint16_t SWK Frame Data Length Code Control Register
 */
uint16_t TLE9563_getSwkDataLengthCodeReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DLC_CTRL.reg;
}

/** \brief Set SWK Frame Data Length Code Control Register
 * 
 *  \param u16_value SWK Frame Data Length Code Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkDataLengthCodeReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDLCCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Payload length in number of bytes 
 * 
 *  \param e_value Payload length in number of bytes 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkDataLengthCode(tSWK_dataLengthCode e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DLC_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DLC_CTRL_DLC_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SWK_DLC_CTRL_DLC_Pos) & TLE9563_SWK_DLC_CTRL_DLC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDLCCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Payload length in number of bytes 
 * 
 *  \return uint16_t Payload length in number of bytes 
 */
uint16_t TLE9563_getSwkDataLengthCode(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DLC_CTRL.bit.DLC;
}

/** \brief Get SWK Data7-Data6 Register Register
 * 
 *  \return uint16_t SWK Data7-Data6 Register Register
 */
uint16_t TLE9563_getSwkData3CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA3_CTRL.reg;
}

/** \brief Set SWK Data7-Data6 Register Register
 * 
 *  \param u16_value SWK Data7-Data6 Register Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkData3CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA3CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Data7 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data7 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData7(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA3_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA3_CTRL_DATA7_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA3_CTRL_DATA7_Pos) & TLE9563_SWK_DATA3_CTRL_DATA7_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA3CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data7 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data7 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData7(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA3_CTRL.bit.DATA7;
}

