jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set Data6 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data6 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData6(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA3_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA3_CTRL_DATA6_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA3_CTRL_DATA6_Pos) & TLE9563_SWK_DATA3_CTRL_DATA6_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA3CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data6 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data6 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData6(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA3_CTRL.bit.DATA6;
}

/** \brief Get SWK Data5-Data4 Register Register
 * 
 *  \return uint16_t SWK Data5-Data4 Register Register
 */
uint16_t TLE9563_getSwkData2CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA2_CTRL.reg;
}

/** \brief Set SWK Data5-Data4 Register Register
 * 
 *  \param u16_value SWK Data5-Data4 Register Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkData2CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA2CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Data5 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data5 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData5(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA2_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA2_CTRL_DATA5_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA2_CTRL_DATA5_Pos) & TLE9563_SWK_DATA2_CTRL_DATA5_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA2CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data5 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data5 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData5(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA2_CTRL.bit.DATA5;
}

/** \brief Set Data4 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data4 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData4(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA2_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA2_CTRL_DATA4_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA2_CTRL_DATA4_Pos) & TLE9563_SWK_DATA2_CTRL_DATA4_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA2CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data4 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data4 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData4(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA2_CTRL.bit.DATA4;
}

/** \brief Get SWK Data3-Data2 Register Register
 * 
 *  \return uint16_t SWK Data3-Data2 Register Register
 */
uint16_t TLE9563_getSwkData1CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA1_CTRL.reg;
}

/** \brief Set SWK Data3-Data2 Register Register
 * 
 *  \param u16_value SWK Data3-Data2 Register Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkData1CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Data3 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data3 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData3(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA1_CTRL_DATA3_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA1_CTRL_DATA3_Pos) & TLE9563_SWK_DATA1_CTRL_DATA3_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data3 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data3 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData3(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA1_CTRL.bit.DATA3;
}

