jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Set Data2 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data2 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData2(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA1_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA1_CTRL_DATA2_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA1_CTRL_DATA2_Pos) & TLE9563_SWK_DATA1_CTRL_DATA2_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA1CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data2 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data2 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData2(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA1_CTRL.bit.DATA2;
}

/** \brief Get SWK Data1-Data0 Register Register
 * 
 *  \return uint16_t SWK Data1-Data0 Register Register
 */
uint16_t TLE9563_getSwkData0CtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA0_CTRL.reg;
}

/** \brief Set SWK Data1-Data0 Register Register
 * 
 *  \param u16_value SWK Data1-Data0 Register Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkData0CtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Data1 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data1 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData1(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA0_CTRL_DATA1_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA0_CTRL_DATA1_Pos) & TLE9563_SWK_DATA0_CTRL_DATA1_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data1 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data1 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData1(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA0_CTRL.bit.DATA1;
}

/** \brief Set Data0 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \param u8_value Data0 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkContentData0(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_DATA0_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_DATA0_CTRL_DATA0_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_DATA0_CTRL_DATA0_Pos) & TLE9563_SWK_DATA0_CTRL_DATA0_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKDATA0CTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Data0 byte content(bit0=LSB; bit7=MSB)
 * 
 *  \return uint16_t Data0 byte content(bit0=LSB; bit7=MSB)
 */
uint16_t TLE9563_getSwkContentData0(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_DATA0_CTRL.bit.DATA0;
}

/** \brief Get CAN FD Configuration Control Register Register
 * 
 *  \return uint16_t CAN FD Configuration Control Register Register
 */
uint16_t TLE9563_getSwkCanFdCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CAN_FD_CTRL.reg;
}

/** \brief Set CAN FD Configuration Control Register Register
 * 
 *  \param u16_value CAN FD Configuration Control Register Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkCanFdCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCANFDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Enable Error Counter Disable Function
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkCanFdErrorCount(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CAN_FD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Pos) & TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCANFDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Error Counter Disable Function
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkCanFdErrorCount(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CAN_FD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Pos) & TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCANFDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Error Counter Disable Function Enable/Disable Setting
 * 
 *  \return  Error Counter Disable Function Status (0: feature enabled, 1: feature disabled)
 */
uint8_t TLE9563_getSwkCanFdErrorCount(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CAN_FD_CTRL.bit.DIS_ERR_CNT;
}

/** \brief Set CAN FD Dominant Filter Time
 * 
 *  \param e_value CAN FD Dominant Filter Time
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setCanFdDomFiltTime(tCANFD_domFiltTime e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CAN_FD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CAN_FD_CTRL_FD_FILTER_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SWK_CAN_FD_CTRL_FD_FILTER_Pos) & TLE9563_SWK_CAN_FD_CTRL_FD_FILTER_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCANFDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get CAN FD Dominant Filter Time
 * 
 *  \return uint16_t CAN FD Dominant Filter Time
 */
uint16_t TLE9563_getCanFdDomFiltTime(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CAN_FD_CTRL.bit.FD_FILTER;
}

/** \brief Enable Enable CAN FD Tolerant Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enCanFdTolerantMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CAN_FD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Pos) & TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCANFDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Enable CAN FD Tolerant Mode
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disCanFdTolerantMode(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CAN_FD_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Pos) & TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCANFDCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Enable CAN FD Tolerant Mode Enable/Disable Setting
 * 
 *  \return  Enable CAN FD Tolerant Mode Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getCanFdTolerantMode(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CAN_FD_CTRL.bit.CAN_FD_EN;
}

