jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get SWK Oscillator Trimming and option Register Register
 * 
 *  \return uint16_t SWK Oscillator Trimming and option Register Register
 */
uint16_t TLE9563_getSwkOscTrimCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_OSC_TRIM_CTRL.reg;
}

/** \brief Set SWK Oscillator Trimming and option Register Register
 * 
 *  \param u16_value SWK Oscillator Trimming and option Register Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkOscTrimCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKOSCTRIMCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set SWK Receiver selection (only accessible if TRIM_EN = '11')
 * 
 *  \param e_value SWK Receiver selection (only accessible if TRIM_EN = '11')
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkReceiver(tSWK_receiver e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_OSC_TRIM_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_OSC_TRIM_CTRL_RX_WK_SEL_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SWK_OSC_TRIM_CTRL_RX_WK_SEL_Pos) & TLE9563_SWK_OSC_TRIM_CTRL_RX_WK_SEL_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKOSCTRIMCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get SWK Receiver selection (only accessible if TRIM_EN = '11')
 * 
 *  \return uint16_t SWK Receiver selection (only accessible if TRIM_EN = '11')
 */
uint16_t TLE9563_getSwkReceiver(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_OSC_TRIM_CTRL.bit.RX_WK_SEL;
}

/** \brief Set Trimming of temp_coef (only writable if TRIM_EN = '11')
 * 
 *  \param u8_value Trimming of temp_coef (only writable if TRIM_EN = '11')
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkTrimTemp(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_OSC_TRIM_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_OSC_TRIM_CTRL_TEMP_COEF_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_OSC_TRIM_CTRL_TEMP_COEF_Pos) & TLE9563_SWK_OSC_TRIM_CTRL_TEMP_COEF_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKOSCTRIMCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Trimming of temp_coef (only writable if TRIM_EN = '11')
 * 
 *  \return uint16_t Trimming of temp_coef (only writable if TRIM_EN = '11')
 */
uint16_t TLE9563_getSwkTrimTemp(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_OSC_TRIM_CTRL.bit.TEMP_COEF;
}

/** \brief Set Trimming of oscillator (only writable if
 * 
 *  \param u8_value Trimming of oscillator (only writable if
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkTrimOsc(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_OSC_TRIM_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_OSC_TRIM_CTRL_TRIM_OSC_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_OSC_TRIM_CTRL_TRIM_OSC_Pos) & TLE9563_SWK_OSC_TRIM_CTRL_TRIM_OSC_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKOSCTRIMCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Trimming of oscillator (only writable if
 * 
 *  \return uint16_t Trimming of oscillator (only writable if
 */
uint16_t TLE9563_getSwkTrimOsc(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_OSC_TRIM_CTRL.bit.TRIM_OSC;
}

/** \brief Get Oscillator Calibration High Register
 * 
 *  \return  Oscillator Calibration High Register Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkOscCalHighRegSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_OSC_CAL_STAT.bit.OSC_CAL_H;
}

/** \brief Get Oscillator Calibration Low Register
 * 
 *  \return  Oscillator Calibration Low Register Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkOscCalLowRegSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_OSC_CAL_STAT.bit.OSC_CAL_L;
}

/** \brief Get Clock Data Recovery Control Register Register
 * 
 *  \return uint16_t Clock Data Recovery Control Register Register
 */
uint16_t TLE9563_getSwkCdrCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CDR_CTRL.reg;
}

/** \brief Set Clock Data Recovery Control Register Register
 * 
 *  \param u16_value Clock Data Recovery Control Register Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkCdrCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Input Frequency for CDR module
 * 
 *  \param e_value Input Frequency for CDR module
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkClockDataRecoveryInputFreq(tSWK_clockDataRecoveryInputFreq e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CDR_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CDR_CTRL_SEL_OSC_CLK_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SWK_CDR_CTRL_SEL_OSC_CLK_Pos) & TLE9563_SWK_CDR_CTRL_SEL_OSC_CLK_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Input Frequency for CDR module
 * 
 *  \return uint16_t Input Frequency for CDR module
 */
uint16_t TLE9563_getSwkClockDataRecoveryInputFreq(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CDR_CTRL.bit.SEL_OSC_CLK;
}

/** \brief Set Select Time Constant of Filter
 * 
 *  \param e_value Select Time Constant of Filter
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkFiltTimeConst(tSWK_filtTimeConst e_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CDR_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CDR_CTRL_SELFILT_Msk)) | (((uint16_t)e_value << (uint16_t)TLE9563_SWK_CDR_CTRL_SELFILT_Pos) & TLE9563_SWK_CDR_CTRL_SELFILT_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Select Time Constant of Filter
 * 
 *  \return uint16_t Select Time Constant of Filter
 */
uint16_t TLE9563_getSwkFiltTimeConst(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CDR_CTRL.bit.SELFILT;
}

/** \brief Enable Enable CDR
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_enSwkClockDataRecovery(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CDR_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CDR_CTRL_CDR_EN_Msk)) | (((uint16_t)1 << (uint16_t)TLE9563_SWK_CDR_CTRL_CDR_EN_Pos) & TLE9563_SWK_CDR_CTRL_CDR_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Disable Enable CDR
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_disSwkClockDataRecovery(void)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CDR_CTRL.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CDR_CTRL_CDR_EN_Msk)) | (((uint16_t)0 << (uint16_t)TLE9563_SWK_CDR_CTRL_CDR_EN_Pos) & TLE9563_SWK_CDR_CTRL_CDR_EN_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRCTRL;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief get Enable CDR Enable/Disable Setting
 * 
 *  \return  Enable CDR Status (1: feature enabled, 0: feature disabled)
 */
uint8_t TLE9563_getSwkClockDataRecovery(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CDR_CTRL.bit.CDR_EN;
}

