jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get SWK Clock Data Recovery Limit Control Register
 * 
 *  \return uint16_t SWK Clock Data Recovery Limit Control Register
 */
uint16_t TLE9563_getSwkCdrLimitCtrlReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CDR_LIMIT.reg;
}

/** \brief Set SWK Clock Data Recovery Limit Control Register
 * 
 *  \param u16_value SWK Clock Data Recovery Limit Control Register content
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkCdrLimitCtrlReg(uint16_t u16_value)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = u16_value;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRLIMIT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Set Upper Bit Time Detection Range of Clock and Data
 * 
 *  \param u8_value Upper Bit Time Detection Range of Clock and Data
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkClockDataRecoveryLimitHigh(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CDR_LIMIT.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CDR_LIMIT_CDR_LIM_H_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_CDR_LIMIT_CDR_LIM_H_Pos) & TLE9563_SWK_CDR_LIMIT_CDR_LIM_H_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRLIMIT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Upper Bit Time Detection Range of Clock and Data
 * 
 *  \return uint16_t Upper Bit Time Detection Range of Clock and Data
 */
uint16_t TLE9563_getSwkClockDataRecoveryLimitHigh(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CDR_LIMIT.bit.CDR_LIM_H;
}

/** \brief Set Lower Bit Time Detection Range of Clock and Data
 * 
 *  \param u8_value Lower Bit Time Detection Range of Clock and Data
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_setSwkClockDataRecoveryLimitLow(uint8_t u8_value)
{
  uint8_t u8_success = 0;
  uint16_t u16_reg_temp = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    /* get register content */
    u16_reg_temp = (uint16_t)TLE9563->SWK_CDR_LIMIT.reg;
    /* modify requested bits */
    u16_reg_temp = (uint16_t)((u16_reg_temp & (~TLE9563_SWK_CDR_LIMIT_CDR_LIM_L_Msk)) | (((uint16_t)u8_value << (uint16_t)TLE9563_SWK_CDR_LIMIT_CDR_LIM_L_Pos) & TLE9563_SWK_CDR_LIMIT_CDR_LIM_L_Msk));
    s_deviceDriver.u16_setBitValue = u16_reg_temp;
    s_deviceDriver.fp_setReg = &TLE9563_setSWKCDRLIMIT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Lower Bit Time Detection Range of Clock and Data
 * 
 *  \return uint16_t Lower Bit Time Detection Range of Clock and Data
 */
uint16_t TLE9563_getSwkClockDataRecoveryLimitLow(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_CDR_LIMIT.bit.CDR_LIM_L;
}

/** \brief Get Supply Voltage Fail Status Register
 * 
 *  \return uint16_t Supply Voltage Fail Status Register
 */
uint16_t TLE9563_getSupStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SUP_STAT.reg;
}

/** \brief Clear Supply Voltage Fail Status Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrSupSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrSUPSTAT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Power-On reset detection
 * 
 *  \return  Power-On reset detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getPorSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.POR;
}

/** \brief Get Charge pump overtemperature
 * 
 *  \return  Charge pump overtemperature Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getCpOverTempSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.CP_OT;
}

/** \brief Get 4th consecutive VCC1 UV-Detection
 * 
 *  \return  4th consecutive VCC1 UV-Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVcc1UnderVoltFsSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VCC1_UV_FS;
}

/** \brief Get HS Supply UV-Detection
 * 
 *  \return  HS Supply UV-Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHsUnderVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.HS_UV;
}

/** \brief Get HS Supply OV-Detection
 * 
 *  \return  HS Supply OV-Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHsOverVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.HS_OV;
}

/** \brief Get VSINT UV-Detection
 * 
 *  \return  VSINT UV-Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVsintUnderVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VSINT_UV;
}

/** \brief Get VSINT OV-Detection
 * 
 *  \return  VSINT OV-Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVsintOverVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VSINT_OV;
}

