jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get VS Undervoltage Detection (VS,UV)
 * 
 *  \return  VS Undervoltage Detection (VS,UV) Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVsUnderVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VS_UV;
}

/** \brief Get VS Overvoltage Detection (VS,OV)
 * 
 *  \return  VS Overvoltage Detection (VS,OV) Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVsOverVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VS_OV;
}

/** \brief Get CP_UV
 * 
 *  \return  CP_UV Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getCpUnterVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.CP_UV;
}

/** \brief Get VCC1 SC
 * 
 *  \return  VCC1 SC Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVcc1ShortCircuitSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VCC1_SC;
}

/** \brief Get VCC1 UV-Detection (due to Vrtx reset)
 * 
 *  \return  VCC1 UV-Detection (due to Vrtx reset) Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVcc1UnterVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VCC1_UV;
}

/** \brief Get VCC1 Overvoltage Detection
 * 
 *  \return  VCC1 Overvoltage Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVcc1OverVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VCC1_OV;
}

/** \brief Get VCC1 Undervoltage Prewarning
 * 
 *  \return  VCC1 Undervoltage Prewarning Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVcc1UnderVoltWarnSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SUP_STAT.bit.VCC1_WARN;
}

/** \brief Get Thermal Protection Status Register
 * 
 *  \return uint16_t Thermal Protection Status Register
 */
uint16_t TLE9563_getThermStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->THERM_STAT.reg;
}

/** \brief Clear Thermal Protection Status Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrThermSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrTHERMSTAT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get TSD2 Thermal Shut-Down Safe State Detection
 * 
 *  \return  TSD2 Thermal Shut-Down Safe State Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getThermShutDown2SafeStateSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->THERM_STAT.bit.TSD2_SAFE;
}

/** \brief Get TSD2 Thermal Shut-Down Detection
 * 
 *  \return  TSD2 Thermal Shut-Down Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getThermShutDown2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->THERM_STAT.bit.TSD2;
}

/** \brief Get TSD1 Thermal Shut-Down Detection
 * 
 *  \return  TSD1 Thermal Shut-Down Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getThermShutDown1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->THERM_STAT.bit.TSD1;
}

/** \brief Get Thermal Pre Warning
 * 
 *  \return  Thermal Pre Warning Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getThermWarnSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->THERM_STAT.bit.TPW;
}

/** \brief Get Device Information Status Register
 * 
 *  \return uint16_t Device Information Status Register
 */
uint16_t TLE9563_getDevStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->DEV_STAT.reg;
}

/** \brief Clear Device Information Status Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrDevSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrDEVSTAT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get CRC STAT Information
 * 
 *  \return  CRC STAT Information Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getCrcSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DEV_STAT.bit.CRC_STAT;
}

/** \brief Get CRC Fail Information1)
 * 
 *  \return  CRC Fail Information1) Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getCrcFailSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DEV_STAT.bit.CRC_FAIL;
}

/** \brief Get Device Status before Restart Mode
 * 
 *  \return  Device Status before Restart Mode Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getDeviceSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DEV_STAT.bit.DEV_STAT;
}

/** \brief Get Status of Operating Mode
 * 
 *  \return  Status of Operating Mode Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getOperatingModeSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DEV_STAT.bit.SW_DEV;
}

/** \brief Get Number of WD-Failure Events
 * 
 *  \return  Number of WD-Failure Events Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWdFailSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DEV_STAT.bit.WD_FAIL;
}

/** \brief Get SPI Fail Information
 * 
 *  \return  SPI Fail Information Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSpiFailSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DEV_STAT.bit.SPI_FAIL;
}

/** \brief Get Failure detection
 * 
 *  \return  Failure detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getFailSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DEV_STAT.bit.FAILURE;
}

/** \brief Get Bus Communication Status Register
 * 
 *  \return uint16_t Bus Communication Status Register
 */
uint16_t TLE9563_getBusStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->BUS_STAT.reg;
}

/** \brief Clear Bus Communication Status Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrBusSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrBUSSTAT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get CAN Time Out Detection
 * 
 *  \return  CAN Time Out Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getCanTimeOutSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BUS_STAT.bit.CANTO;
}

/** \brief Get SWK System Error
 * 
 *  \return  SWK System Error Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkSysErrSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BUS_STAT.bit.SYSERR;
}

