jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get CAN failure status
 * 
 *  \return  CAN failure status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getCanFailSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BUS_STAT.bit.CAN_FAIL;
}

/** \brief Get Under Voltage CAN Bus Supply
 * 
 *  \return  Under Voltage CAN Bus Supply Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVcanUnderVoltSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->BUS_STAT.bit.VCAN_UV;
}

/** \brief Get Wake-up Source and Information Status Register
 * 
 *  \return uint16_t Wake-up Source and Information Status Register
 */
uint16_t TLE9563_getWkStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_STAT.reg;
}

/** \brief Clear Wake-up Source and Information Status Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrWkSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrWKSTAT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Wake up via CAN Bus
 * 
 *  \return  Wake up via CAN Bus Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWkCanWuSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_STAT.bit.CAN_WU;
}

/** \brief Get Wake up via Timer2
 * 
 *  \return  Wake up via Timer2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWkTimer2WuSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_STAT.bit.TIMER2_WU;
}

/** \brief Get Wake up via Timer1
 * 
 *  \return  Wake up via Timer1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWkTimer1WuSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_STAT.bit.TIMER1_WU;
}

/** \brief Get Wake up via WK5
 * 
 *  \return  Wake up via WK5 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWk5WuSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_STAT.bit.WK5_WU;
}

/** \brief Get Wake up via WK4
 * 
 *  \return  Wake up via WK4 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWk4WuSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_STAT.bit.WK4_WU;
}

/** \brief Get WK Input Level Register
 * 
 *  \return uint16_t WK Input Level Register
 */
uint16_t TLE9563_getWkxLvlStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->WK_LVL_STAT.reg;
}

/** \brief Get Status of WK5
 * 
 *  \return  Status of WK5 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWk5LvlSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_LVL_STAT.bit.WK5_LVL;
}

/** \brief Get Status of WK4
 * 
 *  \return  Status of WK4 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getWk4LvlSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->WK_LVL_STAT.bit.WK4_LVL;
}

/** \brief Get High-Side Switch Status Register
 * 
 *  \return uint16_t High-Side Switch Status Register
 */
uint16_t TLE9563_getHsOlOcOtStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->HS_OL_OC_OT_STAT.reg;
}

/** \brief Clear High-Side Switch Status Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrHsOlOcOtSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrHSOLOCOTSTAT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Overtemperature Detection on HS3
 * 
 *  \return  Overtemperature Detection on HS3 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs3OverTempSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS3_OT;
}

/** \brief Get Overtemperature Detection on HS2
 * 
 *  \return  Overtemperature Detection on HS2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs2OverTempSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS2_OT;
}

/** \brief Get Overtemperature Detection on HS1
 * 
 *  \return  Overtemperature Detection on HS1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs1OverTempSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS1_OT;
}

/** \brief Get Open-Load Detection on HS3
 * 
 *  \return  Open-Load Detection on HS3 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs3OpenLoadSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS3_OL;
}

/** \brief Get Open-Load Detection on HS2
 * 
 *  \return  Open-Load Detection on HS2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs2OpenLoadSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS2_OL;
}

/** \brief Get Open-Load Detection on HS1
 * 
 *  \return  Open-Load Detection on HS1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs1OpenLoadSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS1_OL;
}

/** \brief Get Overcurrent Detection on HS3
 * 
 *  \return  Overcurrent Detection on HS3 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs3OverCurSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS3_OC;
}

/** \brief Get Overcurrent Detection on HS2
 * 
 *  \return  Overcurrent Detection on HS2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs2OverCurSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS2_OC;
}

/** \brief Get Overcurrent Detection on HS1
 * 
 *  \return  Overcurrent Detection on HS1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHs1OverCurSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->HS_OL_OC_OT_STAT.bit.HS1_OC;
}

/** \brief Get General Status register Register
 * 
 *  \return uint16_t General Status register Register
 */
uint16_t TLE9563_getGenStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->GEN_STAT.reg;
}

/** \brief Get Voltage level at VSH3 when HB3MODE[10] = 11 and CPEN=1
 * 
 *  \return  Voltage level at VSH3 when HB3MODE[10] = 11 and CPEN=1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHb3Vsh3VoltLvlSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.HB3VOUT;
}

/** \brief Get Voltage level at VSH2 when HB2MODE[10] = 11 and CPEN=1
 * 
 *  \return  Voltage level at VSH2 when HB2MODE[10] = 11 and CPEN=1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHb2Vsh2VoltLvlSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.HB2VOUT;
}

/** \brief Get Voltage level at VSH1 when HB1MODE[10] = 11 and CPEN=1
 * 
 *  \return  Voltage level at VSH1 when HB1MODE[10] = 11 and CPEN=1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHb1Vsh1VoltLvlSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.HB1VOUT;
}

/** \brief Get PWM6 status
 * 
 *  \return  PWM6 status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getPwm6Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.PWM6STAT;
}

/** \brief Get PWM5 status
 * 
 *  \return  PWM5 status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getPwm5Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.PWM5STAT;
}

/** \brief Get PWM4 Status
 * 
 *  \return  PWM4 Status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getPwm4Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.PWM4STAT;
}

/** \brief Get PWM3 status
 * 
 *  \return  PWM3 status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getPwm3Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.PWM3STAT;
}

/** \brief Get PWM2 Status
 * 
 *  \return  PWM2 Status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getPwm2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.PWM2STAT;
}

