jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get PWM1/CRC status
 * 
 *  \return  PWM1/CRC status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getPwm1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->GEN_STAT.bit.PWM1STAT;
}

/** \brief Get Turn-on/off delay regulation register Register
 * 
 *  \return uint16_t Turn-on/off delay regulation register Register
 */
uint16_t TLE9563_getTdregStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TDREG.reg;
}

/** \brief Get HB3 predischarge status Status
 * 
 *  \return  HB3 predischarge status Status (0: Status set, 1: Status not set)
 */
uint8_t TLE9563_getHb3PreDischargeCurClamp(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.IPDCHG3_ST;
}

/** \brief Get HB2 predischarge status Status
 * 
 *  \return  HB2 predischarge status Status (0: Status set, 1: Status not set)
 */
uint8_t TLE9563_getHb2PreDischargeCurClamp(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.IPDCHG2_ST;
}

/** \brief Get HB1 predischarge status Status
 * 
 *  \return  HB1 predischarge status Status (0: Status set, 1: Status not set)
 */
uint8_t TLE9563_getHb1PreDischargeCurClamp(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.IPDCHG1_ST;
}

/** \brief Get HB3 precharge status Status
 * 
 *  \return  HB3 precharge status Status (0: Status set, 1: Status not set)
 */
uint8_t TLE9563_getHb3PreChargeCurClamp(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.IPCHG3_ST;
}

/** \brief Get HB2 precharge status Status
 * 
 *  \return  HB2 precharge status Status (0: Status set, 1: Status not set)
 */
uint8_t TLE9563_getHb2PreChargeCurClamp(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.IPCHG2_ST;
}

/** \brief Get HB1 precharge status Status
 * 
 *  \return  HB1 precharge status Status (0: Status set, 1: Status not set)
 */
uint8_t TLE9563_getHb1PreChargeCurClamp(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.IPCHG1_ST;
}

/** \brief Get HB3 Regulation of turn-on/off delay
 * 
 *  \return  HB3 Regulation of turn-on/off delay Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHb3TdonTdoffRegSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.TDREG3;
}

/** \brief Get HB2 Regulation of turn-on/off delay
 * 
 *  \return  HB2 Regulation of turn-on/off delay Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHb2TdonTdoffRegSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.TDREG2;
}

/** \brief Get HB1 Regulation of turn-on/off delay
 * 
 *  \return  HB1 Regulation of turn-on/off delay Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getHb1TdonTdoffRegSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TDREG.bit.TDREG1;
}

/** \brief Get Drain-source overvoltage Register
 * 
 *  \return uint16_t Drain-source overvoltage Register
 */
uint16_t TLE9563_getDsovStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->DSOV.reg;
}

/** \brief Clear Drain-source overvoltage Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrDsovSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrDSOV;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get CSA Overcurrent detection
 * 
 *  \return  CSA Overcurrent detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getCsaOverCurSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.OC_CSA;
}

/** \brief Get VSINT Brake status
 * 
 *  \return  VSINT Brake status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVsintOverVoltBrakeSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.VSINTOVBRAKE_ST;
}

/** \brief Get VS Brake status
 * 
 *  \return  VS Brake status Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVsOverVoltBrakeSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.VSOVBRAKE_ST;
}

/** \brief Get Drain-source overvoltage on low-side 3 during braking
 * 
 *  \return  Drain-source overvoltage on low-side 3 during braking Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltLs3BrakeSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.LS3DSOV_BRK;
}

/** \brief Get Drain-source overvoltage on low-side 2 during braking
 * 
 *  \return  Drain-source overvoltage on low-side 2 during braking Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltLs2BrakeSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.LS2DSOV_BRK;
}

/** \brief Get Drain-source overvoltage on low-side 1 during braking
 * 
 *  \return  Drain-source overvoltage on low-side 1 during braking Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltLs1BrakeSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.LS1DSOV_BRK;
}

/** \brief Get Drain-source overvoltage on low-side 3
 * 
 *  \return  Drain-source overvoltage on low-side 3 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltLs3Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.LS3DSOV;
}

/** \brief Get Drain-source overvoltage on high-side 3
 * 
 *  \return  Drain-source overvoltage on high-side 3 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltHs3Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.HS3DSOV;
}

/** \brief Get Drain-source overvoltage on low-side 2
 * 
 *  \return  Drain-source overvoltage on low-side 2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltLs2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.LS2DSOV;
}

/** \brief Get Drain-source overvoltage on high-side 2
 * 
 *  \return  Drain-source overvoltage on high-side 2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltHs2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.HS2DSOV;
}

/** \brief Get Drain-source overvoltage on low-side 1
 * 
 *  \return  Drain-source overvoltage on low-side 1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltLs1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.LS1DSOV;
}

/** \brief Get Drain-source overvoltage on high-side 1
 * 
 *  \return  Drain-source overvoltage on high-side 1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getVdsOverVoltHs1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->DSOV.bit.HS1DSOV;
}

/** \brief Get Effective MOSFET turn.on/off delay - HB1 Register
 * 
 *  \return uint16_t Effective MOSFET turn.on/off delay - HB1 Register
 */
uint16_t TLE9563_getEffTdoffTdon1StsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->EFF_TDON_OFF1.reg;
}

