jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get Effective active MOSFET turn-off delay HB1
 * 
 *  \return  Effective active MOSFET turn-off delay HB1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTdoff1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->EFF_TDON_OFF1.bit.TDOFF1EFF;
}

/** \brief Get Effective active MOSFET turn-on delay HB1 Nominal effective tDON1 = 53.3 ns x TDON1EFF[50]D
 * 
 *  \return  Effective active MOSFET turn-on delay HB1 Nominal effective tDON1 = 53.3 ns x TDON1EFF[50]D Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTdon1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->EFF_TDON_OFF1.bit.TDON1EFF;
}

/** \brief Get Effective MOSFET turn.on/off delay - HB 2 Register
 * 
 *  \return uint16_t Effective MOSFET turn.on/off delay - HB 2 Register
 */
uint16_t TLE9563_getEffTdoffTdon2StsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->EFF_TDON_OFF2.reg;
}

/** \brief Get Effective active MOSFET turn-off delay HB2
 * 
 *  \return  Effective active MOSFET turn-off delay HB2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTdoff2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->EFF_TDON_OFF2.bit.TDOFF2EFF;
}

/** \brief Get Effective active MOSFET turn-on delay HB2 Nominal effective tDON2 = 53.3 ns x TDON2EFF[50]D
 * 
 *  \return  Effective active MOSFET turn-on delay HB2 Nominal effective tDON2 = 53.3 ns x TDON2EFF[50]D Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTdon2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->EFF_TDON_OFF2.bit.TDON2EFF;
}

/** \brief Get Effective MOSFET turn.on/off delay - HB3 Register
 * 
 *  \return uint16_t Effective MOSFET turn.on/off delay - HB3 Register
 */
uint16_t TLE9563_getEffTdoffTdon3StsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->EFF_TDON_OFF3.reg;
}

/** \brief Get Effective active MOSFET turn-off delay HB3 Nominal effective tDOFF3 = 53.3 ns x TDO3EFF[138]D
 * 
 *  \return  Effective active MOSFET turn-off delay HB3 Nominal effective tDOFF3 = 53.3 ns x TDO3EFF[138]D Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTdoff3Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->EFF_TDON_OFF3.bit.TDOFF3EFF;
}

/** \brief Get Effective active MOSFET turn-on delay HB3 Nominal effective tDON3 = 53.3 ns x TDON3EFF[50]D
 * 
 *  \return  Effective active MOSFET turn-on delay HB3 Nominal effective tDON3 = 53.3 ns x TDON3EFF[50]D Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTdon3Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->EFF_TDON_OFF3.bit.TDON3EFF;
}

/** \brief Get MOSFET rise/fall time - HB1 Register
 * 
 *  \return uint16_t MOSFET rise/fall time - HB1 Register
 */
uint16_t TLE9563_getEffTfallTrise1StsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TRISE_FALL1.reg;
}

/** \brief Get Active MOSFET fall time HB1
 * 
 *  \return  Active MOSFET fall time HB1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTfall1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TRISE_FALL1.bit.TFALL1;
}

/** \brief Get Active MOSFET rise time HB1
 * 
 *  \return  Active MOSFET rise time HB1 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTrise1Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TRISE_FALL1.bit.TRISE1;
}

/** \brief Get MOSFET rise/fall time - HB2 Register
 * 
 *  \return uint16_t MOSFET rise/fall time - HB2 Register
 */
uint16_t TLE9563_getEffTfallTrise2StsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TRISE_FALL2.reg;
}

/** \brief Get Active MOSFET fall time HB2
 * 
 *  \return  Active MOSFET fall time HB2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTfall2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TRISE_FALL2.bit.TFALL2;
}

/** \brief Get Active MOSFET rise time HB2
 * 
 *  \return  Active MOSFET rise time HB2 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTrise2Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TRISE_FALL2.bit.TRISE2;
}

/** \brief Get MOSFET rise/fall time - HB3 Register
 * 
 *  \return uint16_t MOSFET rise/fall time - HB3 Register
 */
uint16_t TLE9563_getEffTfallTrise3StsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->TRISE_FALL3.reg;
}

/** \brief Get Active MOSFET fall time HB3
 * 
 *  \return  Active MOSFET fall time HB3 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTfall3Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TRISE_FALL3.bit.TFALL3;
}

/** \brief Get Active MOSFET rise time HB3
 * 
 *  \return  Active MOSFET rise time HB3 Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getBdrvEffTrise3Sts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->TRISE_FALL3.bit.TRISE3;
}

/** \brief Get Selective Wake Status Register
 * 
 *  \return uint16_t Selective Wake Status Register
 */
uint16_t TLE9563_getSwkStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->SWK_STAT.reg;
}

/** \brief Clear Selective Wake Status Status
 * 
 *  \warning Status clearing can only be done word-wise, so this function clears the complete status register.
 *  \warning This function will not update the regsiter copy in RAM. 
 * 
 *  \return uint8_t Success (0: request not successful, 1: request successful)
 */
uint8_t TLE9563_clrSwkSts(void)
{
  uint8_t u8_success = 0;
  /* if no current set-register request is set, start set-register request */
  if(s_deviceDriver.fp_setReg == NULL)
  {
    s_deviceDriver.u16_setBitValue = 0x0000;
    s_deviceDriver.fp_setReg = &TLE9563_clrSWKSTAT;
    u8_success = 1;
  }
  return u8_success;
}

/** \brief Get Synchronisation (at least one CAN frame without fail must have been received)
 * 
 *  \return  Synchronisation (at least one CAN frame without fail must have been received) Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkSyncSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_STAT.bit.SYNC;
}

/** \brief Get Wake-up Pattern Detection
 * 
 *  \return  Wake-up Pattern Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkWkPatternDetectSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_STAT.bit.WUP;
}

