jassony/infineon2b6/TLE9563_LLD/src/TLE9563_FuncLayer.c
/** \brief Get SWK Wake-up Frame Detection
 * 
 *  \return  SWK Wake-up Frame Detection Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkWkFrameDetectSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_STAT.bit.WUF;
}

/** \brief Get CAN Silent Time during SWK operation
 * 
 *  \return  CAN Silent Time during SWK operation Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkCanSilentTimeSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_STAT.bit.CANSIL;
}

/** \brief Get Selective Wake Activity
 * 
 *  \return  Selective Wake Activity Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkActivitySts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_STAT.bit.SWK_SET;
}

/** \brief Get SWK CAN Frame Error Counter
 * 
 *  \return  SWK CAN Frame Error Counter Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkCanFrameErrCountSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_ECNT_STAT.bit.ECNT;
}

/** \brief Get Output Value from Filter Block
 * 
 *  \return  Output Value from Filter Block Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getSwkClockDataRecoveryOutputSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->SWK_CDR_STAT.bit.N_AVG;
}

/** \brief Get Family and Product Identification Register Register
 * 
 *  \return uint16_t Family and Product Identification Register Register
 */
uint16_t TLE9563_getFamProdIdStsReg(void)
{
  /* return value from register copy */
  return (uint16_t)TLE9563->FAM_PROD_STAT.reg;
}

/** \brief Get Device Family Identifier
 * 
 *  \return  Device Family Identifier Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getDeviceFamilyIdSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->FAM_PROD_STAT.bit.FAM;
}

/** \brief Get Device Product Identifier
 * 
 *  \return  Device Product Identifier Status (1: Status set, 0: Status not set)
 */
uint8_t TLE9563_getDeviceProductIdSts(void)
{
  /* return value from register copy */
  return (uint8_t)TLE9563->FAM_PROD_STAT.bit.PROD;
}

